mm32/MM32_FDS/library/startup/inc/_mm32.h
////////////////////////////////////////////////////////////////////////////////
#ifndef __MM32_H
#define __MM32_H

#include <stdint.h>
#include <stdbool.h>

#if defined(__MM3N1)
    #define __MPU_PRESENT               (0)                                     ///< mm32f103/mm32l3xx does not provide a MPU present or not
    #define __NVIC_PRIO_BITS            (4)                                     ///< mm32f103/mm32l3xx uses 4 Bits for the Priority Levels
    #define __Vendor_SysTickConfig      (0)                                     ///< Set to 1 if different SysTick Config is used
#endif

#if defined(__MM0N1) || defined(__MM0P1) || defined(__MM0Q1)
    #define __MPU_PRESENT               (0)                                     ///< mm32f031/mm32l0xx does not provide a MPU present or not
    #define __NVIC_PRIO_BITS            (2)                                     ///< mm32f031/mm32l0xx uses 4 Bits for the Priority Levels
    #define __Vendor_SysTickConfig      (0)                                     ///< Set to 1 if different SysTick Config is used
#endif

////////////////////////////////////////////////////////////////////////////////
/// @brief  MM32 MCU Interrupt Handle
////////////////////////////////////////////////////////////////////////////////
#if defined(__MM3N1)
    typedef enum IRQn {
        NonMaskableInt_IRQn             = -14,                                  ///< 2 Non Maskable Interrupt
        MemoryManagement_IRQn           = -12,                                  ///< 4 Cortex-M3 Memory Management Interrupt
        BusFault_IRQn                   = -11,                                  ///< 5 Cortex-M3 Bus Fault Interrupt
        UsageFault_IRQn                 = -10,                                  ///< 6 Cortex-M3 Usage Fault Interrupt
        SVCall_IRQn                     = -5,                                   ///< 11 Cortex-M3 SV Call Interrupt
        DebugMonitor_IRQn               = -4,                                   ///< 12 Cortex-M3 Debug Monitor Interrupt
        PendSV_IRQn                     = -2,                                   ///< 14 Cortex-M3 Pend SV Interrupt
        SysTick_IRQn                    = -1,                                   ///< 15 Cortex-M3 System Tick Interrupt
#endif
#if defined(__MM0N1)
    typedef enum IRQn {
        NonMaskableInt_IRQn             = -14,                                  ///< 2 Non Maskable Interrupt
        HardFault_IRQn                  = -13,                                  ///< 3 Cortex-M0 Hard Fault Interrupt
        SVC_IRQn                        = -5,                                   ///< 11 Cortex-M0 SV Call Interrupt
        PendSV_IRQn                     = -2,                                   ///< 14 Cortex-M0 Pend SV Interrupt
        SysTick_IRQn                    = -1,                                   ///< 15 Cortex-M0 System Tick Interrupt
#endif
#if defined(__MM3O1)
    typedef enum IRQn {
        NonMaskableInt_IRQn             = -14,                                  ///< 2 Non Maskable Interrupt
        MemoryManagement_IRQn           = -12,                                  ///< 4 Cortex-M3 Memory Management Interrupt
        BusFault_IRQn                   = -11,                                  ///< 5 Cortex-M3 Bus Fault Interrupt
        UsageFault_IRQn                 = -10,                                  ///< 6 Cortex-M3 Usage Fault Interrupt
        SVCall_IRQn                     = -5,                                   ///< 11 Cortex-M3 SV Call Interrupt
        DebugMonitor_IRQn               = -4,                                   ///< 12 Cortex-M3 Debug Monitor Interrupt
        PendSV_IRQn                     = -2,                                   ///< 14 Cortex-M3 Pend SV Interrupt
        SysTick_IRQn                    = -1,                                   ///< 15 Cortex-M3 System Tick Interrupt
#endif
#if defined(__MM0P1)
    typedef enum IRQn {
        NonMaskableInt_IRQn             = -14,                                  ///< 2 Non Maskable Interrupt
        HardFault_IRQn                  = -13,                                  ///< 3 Cortex-M0 Hard Fault Interrupt
        MemoryManagement_IRQn           = -12,                                  ///< 4 Cortex-M0 Memory Management Interrupt
        BusFault_IRQn                   = -11,                                  ///< 5 Cortex-M0 Bus Fault Interrupt
        UsageFault_IRQn                 = -10,                                  ///< 6 Cortex-M0 Usage Fault Interrupt
        SVC_IRQn                        = -5,                                   ///< 11 Cortex-M0 SV Call Interrupt
        DebugMonitor_IRQn               = -4,                                   ///< 12 Cortex-M0 Debug Monitor Interrupt
        PendSV_IRQn                     = -2,                                   ///< 14 Cortex-M0 Pend SV Interrupt
        SysTick_IRQn                    = -1,                                   ///< 15 Cortex-M0 System Tick Interrupt
#endif
#if defined(__MM0Q1)
    typedef enum IRQn {
        NonMaskableInt_IRQn             = -14,                                  ///< 2 Non Maskable Interrupt
        HardFault_IRQn                  = -13,                                  ///< 3 Cortex-M0 Hard Fault Interrupt
        MemoryManagement_IRQn           = -12,                                  ///< 4 Cortex-M0 Memory Management Interrupt
        BusFault_IRQn                   = -11,                                  ///< 5 Cortex-M0 Bus Fault Interrupt
        UsageFault_IRQn                 = -10,                                  ///< 6 Cortex-M0 Usage Fault Interrupt
        SVC_IRQn                        = -5,                                   ///< 11 Cortex-M0 SV Call Interrupt
        DebugMonitor_IRQn               = -4,                                   ///< 12 Cortex-M0 Debug Monitor Interrupt
        PendSV_IRQn                     = -2,                                   ///< 14 Cortex-M0 Pend SV Interrupt
        SysTick_IRQn                    = -1,                                   ///< 15 Cortex-M0 System Tick Interrupt
#endif
#if defined(__MM3N1)
        WWDG_IRQn                       = 0,                                    ///< Window WatchDog Interrupt
        PVD_IRQn                        = 1,                                    ///< PVD through EXTI Line detection Interrupt
        TAMPER_IRQn                     = 2,                                    ///< Tamper Interrupt
        RTC_IRQn                        = 3,                                    ///< RTC global Interrupt
        FLASH_IRQn                      = 4,                                    ///< FLASH global Interrupt
        RCC_IRQn                        = 5,                                    ///< RCC global Interrupt
        EXTI0_IRQn                      = 6,                                    ///< EXTI Line0 Interrupt
        EXTI1_IRQn                      = 7,                                    ///< EXTI Line1 Interrupt
        EXTI2_IRQn                      = 8,                                    ///< EXTI Line2 Interrupt
        EXTI3_IRQn                      = 9,                                    ///< EXTI Line3 Interrupt
        EXTI4_IRQn                      = 10,                                   ///< EXTI Line4 Interrupt
        DMA1_Channel1_IRQn              = 11,                                   ///< DMA1 Channel 1 global Interrupt
        DMA1_Channel2_IRQn              = 12,                                   ///< DMA1 Channel 2 global Interrupt
        DMA1_Channel3_IRQn              = 13,                                   ///< DMA1 Channel 3 global Interrupt
        DMA1_Channel4_IRQn              = 14,                                   ///< DMA1 Channel 4 global Interrupt
        DMA1_Channel5_IRQn              = 15,                                   ///< DMA1 Channel 5 global Interrupt
        DMA1_Channel6_IRQn              = 16,                                   ///< DMA1 Channel 6 global Interrupt
        DMA1_Channel7_IRQn              = 17,                                   ///< DMA1 Channel 7 global Interrupt
        ADC1_2_IRQn                     = 18,                                   ///< ADC1 et ADC2 global Interrupt
        USB_HP_CAN1_TX_IRQn             = 19,                                   ///< USB High Priority or CAN1 TX Interrupts
        CAN1_RX1_IRQn                   = 21,                                   ///< CAN1 RX1 Interrupt
        EXTI9_5_IRQn                    = 23,                                   ///< External Line[9:5] Interrupts
        TIM1_BRK_IRQn                   = 24,                                   ///< TIM1 Break Interrupt
        TIM1_UP_IRQn                    = 25,                                   ///< TIM1 Update Interrupt
        TIM1_TRG_COM_IRQn               = 26,                                   ///< TIM1 Trigger and Commutation Interrupt
        TIM1_CC_IRQn                    = 27,                                   ///< TIM1 Capture Compare Interrupt
        TIM2_IRQn                       = 28,                                   ///< TIM2 global Interrupt
        TIM3_IRQn                       = 29,                                   ///< TIM3 global Interrupt
        TIM4_IRQn                       = 30,                                   ///< TIM4 global Interrupt
        I2C1_EV_IRQn                    = 31,                                   ///< I2C1 Event Interrupt
        I2C2_EV_IRQn                    = 33,                                   ///< I2C2 Event Interrupt
        SPI1_IRQn                       = 35,                                   ///< SPI1 global Interrupt
        SPI2_IRQn                       = 36,                                   ///< SPI2 global Interrupt
        UART1_IRQn                      = 37,                                   ///< UART1 global Interrupt
        UART2_IRQn                      = 38,                                   ///< UART2 global Interrupt
        UART3_IRQn                      = 39,                                   ///< UART3 global Interrupt
        EXTI15_10_IRQn                  = 40,                                   ///< External Line[15:10] Interrupts
        RTCAlarm_IRQn                   = 41,                                   ///< RTC Alarm through EXTI Line Interrupt
        USBWakeUp_IRQn                  = 42,                                   ///< USB WakeUp from suspend through EXTI Line Interrupt
        AES_IRQn                        = 45,                                   ///< AES Encrypt Interrupt


    } IRQn_Type;
#endif
#if defined(__MM0N1)
        WWDG_IRQn                       = 0,                                    ///< Window WatchDog Interrupt
        PVD_IRQn                        = 1,                                    ///< PVD through EXTI Line detect Interrupt
        TAMPER_IRQn                     = 2,                                    ///< RTC through EXTI Line Interrupt
        FLASH_IRQn                      = 3,                                    ///< FLASH Interrupt
        RCC_CRS_IRQn                    = 4,                                    ///< RCC & CRS Interrupt
        EXTI0_1_IRQn                    = 5,                                    ///< EXTI Line 0 and 1 Interrupts
        EXTI2_3_IRQn                    = 6,                                    ///< EXTI Line 2 and 3 Interrupts
        EXTI4_15_IRQn                   = 7,                                    ///< EXTI Line 4 to 15 Interrupts
        DMA1_Channel1_IRQn              = 9,                                    ///< DMA1 Channel 1 Interrupt
        DMA1_Channel2_3_IRQn            = 10,                                   ///< DMA1 Channel 2 and Channel 3 Interrupts
        DMA1_Channel4_5_IRQn            = 11,                                   ///< DMA1 Channel 4 and Channel 5 Interrupts
        ADC_COMP_IRQn                   = 12,                                   ///< ADC & COMP Interrupts
        TIM1_BRK_UP_TRG_COM_IRQn        = 13,                                   ///< TIM1 Break, Update, Trigger and Commutation Interrupts
        TIM1_CC_IRQn                    = 14,                                   ///< TIM1 Capture Compare Interrupt
        TIM2_IRQn                       = 15,                                   ///< TIM2 Interrupt
        TIM3_IRQn                       = 16,                                   ///< TIM3 Interrupt
        TIM14_IRQn                      = 19,                                   ///< TIM14 Interrupt
        TIM16_IRQn                      = 21,                                   ///< TIM16 Interrupt
        TIM17_IRQn                      = 22,                                   ///< TIM17 Interrupt
        I2C1_IRQn                       = 23,                                   ///< I2C1 Interrupt
        SPI1_IRQn                       = 25,                                   ///< SPI1 Interrupt
        SPI2_IRQn                       = 26,                                   ///< SPI1 Interrupt
        UART1_IRQn                      = 27,                                   ///< UART1 Interrupt
        UART2_IRQn                      = 28,                                   ///< UART2 Interrupt
        AES_IRQn                        = 29,                                   ///< AES Interrupt
        CAN_IRQn                        = 30,                                   ///< CAN Interrupt
        USB_IRQn                        = 31,                                   ///< USB Interrupt
    } IRQn_Type;
#endif
#if defined(__MM0P1)
        WWDG_IWDG_IRQn                  = 0,                                    ///< WatchDog Interrupt
        PVD_IRQn                        = 1,                                    ///< PVD through EXTI Line detect Interrupt
        PWM_IRQn                        = 2,                                    ///< PWM Control Interrupt
        FLASH_IRQn                      = 3,                                    ///< FLASH Interrupt
        RCC_IRQn                        = 4,                                    ///< RCC Interrupt
        EXTI0_1_IRQn                    = 5,                                    ///< EXTI Line 0 and 1 Interrupts
        EXTI2_3_IRQn                    = 6,                                    ///< EXTI Line 2 and 3 Interrupts
        EXTI4_15_IRQn                   = 7,                                    ///< EXTI Line 4 to 15 Interrupts
        HWDIV_IRQn                      = 8,                                    ///< HWDIV Global Interrupt
        DMA1_Channel1_IRQn              = 9,                                    ///< DMA1 Channel 1 Interrupt
        DMA1_Channel2_3_IRQn            = 10,                                   ///< DMA1 Channel 2 and Channel 3 Interrupts
        DMA1_Channel4_5_IRQn            = 11,                                   ///< DMA1 Channel 4 and Channel 5 Interrupts
        ADC1_IRQn                       = 12,                                   ///< ADC1 Global Interrupts
        TIM1_BRK_UP_TRG_COM_IRQn        = 13,                                   ///< TIM1 Break, Update, Trigger and Commutation Interrupts
        TIM1_CC_IRQn                    = 14,                                   ///< TIM1 Capture Compare Interrupt
        TIM2_IRQn                       = 15,                                   ///< TIM2 Interrupt
        TIM3_IRQn                       = 16,                                   ///< TIM3 Interrupt
        TIM8_BRK_UP_TRG_COM_IRQn        = 17,                                   ///< TIM8 Brake, Update, Trigger and Commutation Interrupts
        TIM8_CC_IRQn                    = 18,                                   ///< TIM8 Capture Compare Interrupt
        TIM14_IRQn                      = 19,                                   ///< TIM14 Interrupt
        ADC2_IRQn                       = 20,                                   ///< ADC2 Interrupt
        TIM16_IRQn                      = 21,                                   ///< TIM16 Interrupt
        TIM17_IRQn                      = 22,                                   ///< TIM17 Interrupt
        I2C1_IRQn                       = 23,                                   ///< I2C1 Interrupt
        COMP1_2_3_4_5_IRQn              = 24,                                   ///< Comparators Interrupt
        SPI1_IRQn                       = 25,                                   ///< SPI1 Interrupt
        SPI2_IRQn                       = 26,                                   ///< SPI2 Interrupt
        UART1_IRQn                      = 27,                                   ///< UART1 Interrupt
        UART2_IRQn                      = 28,                                   ///< UART2 Interrupt
        Cache_IRQn                      = 29,                                   ///< Cache Interrupt
    } IRQn_Type;
#endif
#if defined(__MM0Q1)
        WWDG_IWDG_IRQn                  = 0,                                    ///< WatchDog Interrupt
        PVD_IRQn                        = 1,                                    ///< PVD through EXTI Line detect Interrupt
        PWM_IRQn                        = 2,                                    ///< PWM Control Interrupt
        FLASH_IRQn                      = 3,                                    ///< FLASH Interrupt
        RCC_IRQn                        = 4,                                    ///< RCC Interrupt
        EXTI0_1_IRQn                    = 5,                                    ///< EXTI Line 0 and 1 Interrupts
        EXTI2_3_IRQn                    = 6,                                    ///< EXTI Line 2 and 3 Interrupts
        EXTI4_15_IRQn                   = 7,                                    ///< EXTI Line 4 to 15 Interrupts
        HWDIV_IRQn                      = 8,                                    ///< HWDIV Global Interuupt
        DMA1_Channel1_IRQn              = 9,                                    ///< DMA Channel 1 Interrupt
        DMA1_Channel2_3_IRQn            = 10,                                   ///< DMA Channel 2 and Channel 3 Interrupts
        DMA1_Channel4_5_IRQn            = 11,                                   ///< DMA Channel 4 and Channel 5 Interrupts
        ADC_COMP_IRQn                   = 12,                                   ///< ADC and COMP Global Interrupts
        TIM1_BRK_UP_TRG_COM_IRQn        = 13,                                   ///< TIM1 Break, Update, Trigger and Commutation Interrupts
        TIM1_CC_IRQn                    = 14,                                   ///< TIM1 Capture Compare Interrupt
        TIM2_IRQn                       = 15,                                   ///< TIM2 Interrupt
        TIM3_IRQn                       = 16,                                   ///< TIM3 Interrupt
        TIM14_IRQn                      = 19,                                   ///< TIM14 Interrupt
        TIM16_IRQn                      = 21,                                   ///< TIM16 Interrupt
        TIM17_IRQn                      = 22,                                   ///< TIM17 Interrupt
        I2C1_IRQn                       = 23,                                   ///< I2C1 Interrupt
        SPI2_IRQn                       = 26,                                   ///< SPI2 Interrupt
        UART1_IRQn                      = 27,                                   ///< UART1 Interrupt
        UART2_IRQn                      = 28,                                   ///< UART2 Interrupt
    } IRQn_Type;
#endif

#if defined(__MM3N1)
    #include <core_cm3.h>
#endif

