mm32/MM32_FDS/library/startup/inc/_mm32.h
#if defined(__MM0N1) || defined(__MM0P1) || defined(__MM0Q1)
    #include <core_cm0.h>
#endif

////////////////////////////////////////////////////////////////////////////////
/// @brief  MM32 MCU Memory/Peripherals mapping
////////////////////////////////////////////////////////////////////////////////
#define FLASH_BASE                      (0x08000000U)                           ///< FLASH base address in the alias region
#define SRAM_BASE                       (0x20000000U)                           ///< SRAM base address in the alias region
#define PERIPH_BASE                     (0x40000000U)                           ///< Peripheral base address in the alias region

#if defined(__MM3N1)
    #define EEPROM_BASE                 (0x08100000U)                           ///< EEPROM base address in the alias region
#endif

#if defined(__MM3N1) || defined(__MM3O1)
    #define SRAM_BITBAND_BASE           (0x22000000U)                           ///< Peripheral base address in the bit-band region
    #define PERIPH_BITBAND_BASE         (0x42000000U)                           ///< SRAM base address in the bit-band region
#endif

#define APB1PERIPH_BASE                 (PERIPH_BASE + 0x00000000)
#define APB2PERIPH_BASE                 (PERIPH_BASE + 0x00010000)
#define AHBPERIPH_BASE                  (PERIPH_BASE + 0x00020000)
#define APB3PERIPH_BASE                 (PERIPH_BASE + 0x00030000)
#define AHB2PERIPH_BASE                 (PERIPH_BASE + 0x08000000)

////////////////////////////////////////////////////////////////////////////////
/// @brief ADC Base Address Definition
////////////////////////////////////////////////////////////////////////////////
#define ADC1_BASE                       (APB2PERIPH_BASE + 0x2400)              ///< Base Address: 0x40012400
#if defined(__MM3N1) || defined(__MM0P1)
    #define ADC2_BASE                   (APB2PERIPH_BASE + 0x2800)              ///< Base Address: 0x40012800
#endif

////////////////////////////////////////////////////////////////////////////////
/// @brief AES Base Address Definition
////////////////////////////////////////////////////////////////////////////////
#if defined(__MM3N1) || defined(__MM0N1)
    #define AES_BASE                    (AHBPERIPH_BASE + 0x6000)               ///< Base Address: 0x40026000
#endif

////////////////////////////////////////////////////////////////////////////////
/// @brief BKP Base Address Definition
////////////////////////////////////////////////////////////////////////////////
#if defined(__MM3N1)
    #define BKP_BASE                    (APB1PERIPH_BASE + 0x6C00)              ///< Base Address: 0x40006C00
#endif

#if defined(__MM0N1) || defined(__MM0P1)
    #define BKP_BASE                    (APB1PERIPH_BASE + 0x280C)              ///< Base Address: 0x4000280C
#endif

////////////////////////////////////////////////////////////////////////////////
/// @brief CAN Base Address Definition
////////////////////////////////////////////////////////////////////////////////
#if defined(__MM3N1) || defined(__MM0N1) || defined(__MM3O1)
    #define CAN1_BASE                   (APB1PERIPH_BASE + 0x6400)              ///< Base Address: 0x40006400
#endif

////////////////////////////////////////////////////////////////////////////////
/// @brief COMP Base Address Definition
////////////////////////////////////////////////////////////////////////////////
#define COMP_BASE                       (APB2PERIPH_BASE + 0x3C00)              ///< Base Address: 0x40013C00

////////////////////////////////////////////////////////////////////////////////
/// @brief CRC Base Address Definition
////////////////////////////////////////////////////////////////////////////////
#define CRC_BASE                        (AHBPERIPH_BASE + 0x3000)               ///< Base Address: 0x40023000

////////////////////////////////////////////////////////////////////////////////
/// @brief CRS Base Address Definition
////////////////////////////////////////////////////////////////////////////////
#if defined(__MM0N1)
    #define CRS_BASE                    (APB1PERIPH_BASE + 0x6C00)              ///< Base Address: 0x40006C00
#endif

////////////////////////////////////////////////////////////////////////////////
/// @brief DAC Base Address Definition
////////////////////////////////////////////////////////////////////////////////
#if defined(__MM3N1)
    #define DAC_BASE                    (APB1PERIPH_BASE + 0x7400)              ///< Base Address: 0x40007400
#endif

////////////////////////////////////////////////////////////////////////////////
/// @brief DBG Base Address Definition
////////////////////////////////////////////////////////////////////////////////
#if defined(__MM3N1)
    #define DBG_BASE                    (APB1PERIPH_BASE + 0x7080)              ///< Base Address: 0x40007080
#endif

#if defined(__MM0N1) || defined(__MM0P1) || defined(__MM0Q1)
    #define DBG_BASE                    (APB2PERIPH_BASE + 0x3400)              ///< Base Address: 0x40013400
#endif

////////////////////////////////////////////////////////////////////////////////
/// @brief DIV Base Address Definition
////////////////////////////////////////////////////////////////////////////////
#if defined(__MM0P1) || defined(__MM0Q1)
    #define DIV_BASE                    (APB3PERIPH_BASE + 0x0000)              ///< Base Address: 0x40030000
#endif

////////////////////////////////////////////////////////////////////////////////
/// @brief DMA Base Address Definition
////////////////////////////////////////////////////////////////////////////////
#define DMA1_BASE                       (AHBPERIPH_BASE + 0x0000)               ///< Base Address: 0x40020000
#define DMA1_Channel1_BASE              (AHBPERIPH_BASE + 0x0008)               ///< Base Address: 0x40020008
#define DMA1_Channel2_BASE              (AHBPERIPH_BASE + 0x001C)               ///< Base Address: 0x4002001C
#define DMA1_Channel3_BASE              (AHBPERIPH_BASE + 0x0030)               ///< Base Address: 0x40020030
#define DMA1_Channel4_BASE              (AHBPERIPH_BASE + 0x0044)               ///< Base Address: 0x40020044
#define DMA1_Channel5_BASE              (AHBPERIPH_BASE + 0x0058)               ///< Base Address: 0x40020058

#if defined(__MM3N1)
    #define DMA1_Channel6_BASE          (AHBPERIPH_BASE + 0x006C)               ///< Base Address: 0x4002006C
    #define DMA1_Channel7_BASE          (AHBPERIPH_BASE + 0x0080)               ///< Base Address: 0x40020080
#endif

////////////////////////////////////////////////////////////////////////////////
/// @brief EXTI Base Address Definition
////////////////////////////////////////////////////////////////////////////////
#define EXTI_BASE                       (APB2PERIPH_BASE + 0x0000)              ///< Base Address: 0x40010000

////////////////////////////////////////////////////////////////////////////////
/// @brief FLASH Base Address Definition
////////////////////////////////////////////////////////////////////////////////
#define FLASH_REG_BASE                  (AHBPERIPH_BASE + 0x2000)               ///< Base Address: 0x40022000

////////////////////////////////////////////////////////////////////////////////
/// @brief GPIO Base Address Definition
////////////////////////////////////////////////////////////////////////////////
#if defined(__MM3N1)
    #define GPIOA_BASE                  (APB2PERIPH_BASE + 0x0800)              ///< Base Address: 0x40010800
    #define GPIOB_BASE                  (APB2PERIPH_BASE + 0x0C00)              ///< Base Address: 0x40010C00
    #define GPIOC_BASE                  (APB2PERIPH_BASE + 0x1000)              ///< Base Address: 0x40011000
    #define GPIOD_BASE                  (APB2PERIPH_BASE + 0x1400)              ///< Base Address: 0x40011400
#endif

