mm32/MM32_FDS/library/startup/inc/_mm32.h
#if defined(__MM0N1) || defined(__MM0P1) || defined(__MM0Q1)
    #define GPIOA_BASE                  (AHB2PERIPH_BASE + 0x0000)              ///< Base Address: 0x48000000
    #define GPIOB_BASE                  (AHB2PERIPH_BASE + 0x0400)              ///< Base Address: 0x48000400
    #define GPIOC_BASE                  (AHB2PERIPH_BASE + 0x0800)              ///< Base Address: 0x48000800
    #define GPIOD_BASE                  (AHB2PERIPH_BASE + 0x0C00)              ///< Base Address: 0x48000C00
#endif

////////////////////////////////////////////////////////////////////////////////
/// @brief I2C Base Address Definition
////////////////////////////////////////////////////////////////////////////////
#define I2C1_BASE                       (APB1PERIPH_BASE + 0x5400)              ///< Base Address: 0x40005400
#if defined(__MM3N1)
    #define I2C2_BASE                   (APB1PERIPH_BASE + 0x5800)              ///< Base Address: 0x40005800
#endif

////////////////////////////////////////////////////////////////////////////////
/// @brief IWDG Base Address Definition
////////////////////////////////////////////////////////////////////////////////
#define IWDG_BASE                       (APB1PERIPH_BASE + 0x3000)              ///< Base Address: 0x40003000

////////////////////////////////////////////////////////////////////////////////
/// @brief OPAMP Base Address Definition
////////////////////////////////////////////////////////////////////////////////
#if defined(__MM0P1)
    #define OPAMP_BASE                  (APB2PERIPH_BASE + 0x3C10)              ///< Base Address: 0x40013C10
#endif

////////////////////////////////////////////////////////////////////////////////
/// @brief OPTB Base Address Definition
////////////////////////////////////////////////////////////////////////////////
#define OB_BASE                         (0x1FFFF800U)                           ///< Flash Option Bytes base address
#define PROTECT_BASE                    (0x1FFE0000U)                           ///< Flash Protect Bytes base address

////////////////////////////////////////////////////////////////////////////////
/// @brief PWM Base Address Definition
////////////////////////////////////////////////////////////////////////////////
#if defined(__MM0P1) || defined(__MM0Q1)
    #define PWM_BASE                    (APB2PERIPH_BASE + 0x6400)              ///< Base Address: 0x40016400
#endif

////////////////////////////////////////////////////////////////////////////////
/// @brief PWR Base Address Definition
////////////////////////////////////////////////////////////////////////////////
#define PWR_BASE                        (APB1PERIPH_BASE + 0x7000)              ///< Base Address: 0x40007000

////////////////////////////////////////////////////////////////////////////////
/// @brief RCC Base Address Definition
////////////////////////////////////////////////////////////////////////////////
#define RCC_BASE                        (AHBPERIPH_BASE + 0x1000)               ///< Base Address: 0x40021000

////////////////////////////////////////////////////////////////////////////////
/// @brief RTC Base Address Definition
////////////////////////////////////////////////////////////////////////////////
#if defined(__MM3N1) || defined(__MM3O1)
    #define RTC_BASE                    (APB1PERIPH_BASE + 0x2800)              ///< Base Address: 0x40002800
#endif

////////////////////////////////////////////////////////////////////////////////
/// @brief SPI Base Address Definition
////////////////////////////////////////////////////////////////////////////////
#define SPI2_BASE                       (APB1PERIPH_BASE + 0x3800)              ///< Base Address: 0x40003000

#if defined(__MM3N1) || defined(__MM0N1) || defined(__MM0P1)
    #define SPI1_BASE                   (APB2PERIPH_BASE + 0x3000)              ///< Base Address: 0x40003000
#endif

////////////////////////////////////////////////////////////////////////////////
/// @brief SQRT Base Address Definition
////////////////////////////////////////////////////////////////////////////////
#if defined(__MM0P1) || defined(__MM0Q1)
    #define SQRT_BASE                   (APB3PERIPH_BASE + 0x0400)              ///< Base Address: 0x40030400
#endif

////////////////////////////////////////////////////////////////////////////////
/// @brief TIM Base Address Definition
////////////////////////////////////////////////////////////////////////////////
#define TIM1_BASE                       (APB2PERIPH_BASE + 0x2C00)              ///< Base Address: 0x40012C00
#define TIM2_BASE                       (APB1PERIPH_BASE + 0x0000)              ///< Base Address: 0x40000000
#define TIM3_BASE                       (APB1PERIPH_BASE + 0x0400)              ///< Base Address: 0x40000400

#if defined(__MM3N1) || defined(__MM3O1)
    #define TIM4_BASE                   (APB1PERIPH_BASE + 0x0800)              ///< Base Address: 0x40000800
#endif

#if defined(__MM3O1)
    #define TIM5_BASE                   (APB1PERIPH_BASE + 0x0C00)              ///< Base Address: 0x40000C00
    #define TIM6_BASE                   (APB1PERIPH_BASE + 0x1000)              ///< Base Address: 0x40001000
    #define TIM7_BASE                   (APB1PERIPH_BASE + 0x1400)              ///< Base Address: 0x40001400
    #define TIM8_BASE                   (APB2PERIPH_BASE + 0x3400)              ///< Base Address: 0x40013400
#endif

#if defined(__MM0P1)
    #define TIM8_BASE                   (APB2PERIPH_BASE + 0x0800)              ///< Base Address: 0x40010800
#endif

#if defined(__MM0N1) || defined(__MM0P1) || defined(__MM0Q1)
    #define TIM14_BASE                  (APB2PERIPH_BASE + 0x4000)              ///< Base Address: 0x40014000
    #define TIM16_BASE                  (APB2PERIPH_BASE + 0x4400)              ///< Base Address: 0x40014400
    #define TIM17_BASE                  (APB2PERIPH_BASE + 0x4800)              ///< Base Address: 0x40014800
#endif

////////////////////////////////////////////////////////////////////////////////
/// @brief UART Base Address Definition
////////////////////////////////////////////////////////////////////////////////
#define UART1_BASE                      (APB2PERIPH_BASE + 0x3800)              ///< Base Address: 0x40013800
#define UART2_BASE                      (APB1PERIPH_BASE + 0x4400)              ///< Base Address: 0x40004400

#if defined(__MM3N1)
    #define UART3_BASE                  (APB1PERIPH_BASE + 0x4800)              ///< Base Address: 0x40004800
#endif

////////////////////////////////////////////////////////////////////////////////
/// @brief USB Base Address Definition
////////////////////////////////////////////////////////////////////////////////
#if defined(__MM3N1) || defined(__MM0N1)
    #define USB_BASE                    (APB1PERIPH_BASE + 0x5C00)              ///< Base Address: 0x40005C00
#endif

////////////////////////////////////////////////////////////////////////////////
/// @brief UID type pointer Definition
////////////////////////////////////////////////////////////////////////////////
#if defined(__MM3N1) || defined(__MM0N1) || defined(__MM0Q1)
    #define UID_BASE                    (0x1FFFF7E8U)                           ///< Unique device ID register base address
#endif

////////////////////////////////////////////////////////////////////////////////
/// @brief WWDG Base Address Definition
////////////////////////////////////////////////////////////////////////////////
#define WWDG_BASE                       (APB1PERIPH_BASE + 0x2C00)              ///< Base Address: 0x40002C00

////////////////////////////////////////////////////////////////////////////////
/// @brief Analog-to-Digital Converter register
////////////////////////////////////////////////////////////////////////////////
typedef struct {
    __IO u32 DR;                                                                ///< ADC data register,                             offset: 0x00
    __IO u32 CFGR;                                                              ///< ADC configuration register,                    offset: 0x04
    __IO u32 CR;                                                                ///< ADC control register,                          offset: 0x08
    __IO u32 CHSR;                                                              ///< ADC channel selection register,                offset: 0x0C
    __IO u32 CMPR;                                                              ///< ADC window compare register,                   offset: 0x10
    __IO u32 SR;                                                                ///< ADC status register,                           offset: 0x14
    __IO u32 CH0DR;                                                             ///< ADC channel0 data register,                    offset: 0x18
    __IO u32 CH1DR;                                                             ///< ADC channel1 data register,                    offset: 0x1C
    __IO u32 CH2DR;                                                             ///< ADC channel2 data register,                    offset: 0x20
    __IO u32 CH3DR;                                                             ///< ADC channel3 data register,                    offset: 0x24
    __IO u32 CH4DR;                                                             ///< ADC channel4 data register,                    offset: 0x28
    __IO u32 CH5DR;                                                             ///< ADC channel5 data register,                    offset: 0x2C
    __IO u32 CH6DR;                                                             ///< ADC channel6 data register,                    offset: 0x30
    __IO u32 CH7DR;                                                             ///< ADC channel7 data register,                    offset: 0x34
    __IO u32 CH8DR;                                                             ///< ADC channel8 data register,                    offset: 0x38
#if defined(__MM0N1) || defined(__MM0P1) || defined(__MM0Q1)
    __IO u32 CH9DR;                                                             ///< ADC channel9 data register,                    offset: 0x3C
    __IO u32 CH10DR;                                                            ///< ADC channel10 data register,                   offset: 0x40
    __IO u32 CH11DR;                                                            ///< ADC channel11 data register,                   offset: 0x44
#endif
#if defined(__MM0P1)|| defined(__MM0Q1)
    __IO u32 RESERVED0;
    __IO u32 CH13DR;                                                            ///< ADC channel13 data register,                   offset: 0x4C
    __IO u32 CH14DR;                                                            ///< ADC channel14 data register,                   offset: 0x50
    __IO u32 CH15DR;                                                            ///< ADC channel15 data register,                   offset: 0x54
    __IO u32 SR_EXT;                                                            ///< ADC Extended Status Register,                  offset: 0x58
#endif
} ADC_TypeDef;

////////////////////////////////////////////////////////////////////////////////
/// @brief AES Register Structure Definition
////////////////////////////////////////////////////////////////////////////////
#if defined(__MM3N1) || defined(__MM0N1)
////////////////////////////////////////////////////////////////////////////////
/// @brief Advanced Encryption Standard
////////////////////////////////////////////////////////////////////////////////
typedef struct {
    __IO u32 CR;                                                                ///< AES control register,                          offset: 0x00
    __IO u32 SR;                                                                ///< AES status register,                           offset: 0x04
    __IO u32 DINR;                                                              ///< AES data input register,                       offset: 0x08
    __IO u32 DOUTR;                                                             ///< AES data output register,                      offset: 0x0C
    __IO u32 KEYR0;                                                             ///< AES key register 0,                            offset: 0x10
    __IO u32 KEYR1;                                                             ///< AES key register 1,                            offset: 0x14
    __IO u32 KEYR2;                                                             ///< AES key register 2,                            offset: 0x18
    __IO u32 KEYR3;                                                             ///< AES key register 3,                            offset: 0x1C
    __IO u32 IVR0;                                                              ///< AES initialization vector register 0,          offset: 0x20
    __IO u32 IVR1;                                                              ///< AES initialization vector register 1,          offset: 0x24
    __IO u32 IVR2;                                                              ///< AES initialization vector register 2,          offset: 0x28
    __IO u32 IVR3;                                                              ///< AES initialization vector register 3,          offset: 0x2C
    __IO u32 KEYR4;                                                             ///< AES key register 4,                            offset: 0x30
    __IO u32 KEYR5;                                                             ///< AES key register 5,                            offset: 0x34
    __IO u32 KEYR6;                                                             ///< AES key register 6,                            offset: 0x38
    __IO u32 KEYR7;                                                             ///< AES key register 7,                            offset: 0x3C
} AES_TypeDef;
#endif

////////////////////////////////////////////////////////////////////////////////
/// @brief BKP Register Structure Definition
////////////////////////////////////////////////////////////////////////////////
#if defined(__MM3N1) || defined(__MM0N1)
#define BKP_NUMBER  10

