mm32/MM32_FDS/library/startup/inc/_mm32.h
typedef struct {
    __IO u32 RESERVED0;                                                         ///< Reserved,                                      offset: 0x00
    __IO u32 DR1;                                                               ///< BKP data register 1,                           offset: 0x04
    __IO u32 DR2;                                                               ///< BKP data register 2,                           offset: 0x08
    __IO u32 DR3;                                                               ///< BKP data register 3,                           offset: 0x0C
    __IO u32 DR4;                                                               ///< BKP data register 4,                           offset: 0x10
    __IO u32 DR5;                                                               ///< BKP data register 5,                           offset: 0x14
    __IO u32 DR6;                                                               ///< BKP data register 6,                           offset: 0x18
    __IO u32 DR7;                                                               ///< BKP data register 7,                           offset: 0x1C
    __IO u32 DR8;                                                               ///< BKP data register 8,                           offset: 0x20
    __IO u32 DR9;                                                               ///< BKP data register 9,                           offset: 0x24
    __IO u32 DR10;                                                              ///< BKP data register 10,                          offset: 0x28
#if defined(__MM3N1)
    __IO u32 RTCCR;                                                             ///< RTC clock calibration register,                offset: 0x2C
    __IO u32 CR;                                                                ///< BKP control register,                          offset: 0x30
    __IO u32 CSR;                                                               ///< BKP control/status register,                   offset: 0x34
#endif
} BKP_TypeDef;
#endif

#if defined(__MM0P1)
#define BKP_NUMBER  20

typedef struct {
    __IO u32 RESERVED0;                                                         ///< Reserved,                                      offset: 0x00
    __IO u32 DR1;                                                               ///< BKP data register 1,                           offset: 0x04
    __IO u32 DR2;                                                               ///< BKP data register 2,                           offset: 0x08
    __IO u32 DR3;                                                               ///< BKP data register 3,                           offset: 0x0C
    __IO u32 DR4;                                                               ///< BKP data register 4,                           offset: 0x10
    __IO u32 DR5;                                                               ///< BKP data register 5,                           offset: 0x14
    __IO u32 DR6;                                                               ///< BKP data register 6,                           offset: 0x18
    __IO u32 DR7;                                                               ///< BKP data register 7,                           offset: 0x1C
    __IO u32 DR8;                                                               ///< BKP data register 8,                           offset: 0x20
    __IO u32 DR9;                                                               ///< BKP data register 9,                           offset: 0x24
    __IO u32 DR10;                                                              ///< BKP data register 10                           offset: 0x28
    __IO u32 DR11;                                                              ///< BKP data register 11,                          offset: 0x2C
    __IO u32 DR12;                                                              ///< BKP data register 12,                          offset: 0x30
    __IO u32 DR13;                                                              ///< BKP data register 13,                          offset: 0x34
    __IO u32 DR14;                                                              ///< BKP data register 14,                          offset: 0x38
    __IO u32 DR15;                                                              ///< BKP data register 15,                          offset: 0x3C
    __IO u32 DR16;                                                              ///< BKP data register 16,                          offset: 0x40
    __IO u32 DR17;                                                              ///< BKP data register 17,                          offset: 0x44
    __IO u32 DR18;                                                              ///< BKP data register 18,                          offset: 0x48
    __IO u32 DR19;                                                              ///< BKP data register 19,                          offset: 0x4C
    __IO u32 DR20;                                                              ///< BKP data register 20,                          offset: 0x50
} BKP_TypeDef;
#endif

////////////////////////////////////////////////////////////////////////////////
/// @brief CAN Register Structure Definition
////////////////////////////////////////////////////////////////////////////////
#if defined(__MM3N1) || defined(__MM0N1) || defined(__MM3O1)

////////////////////////////////////////////////////////////////////////////////
/// @brief CAN basic
////////////////////////////////////////////////////////////////////////////////
typedef struct {
    __IO u32 CR;                                                                ///< Control register,                              offset: 0x00
    __IO u32 CMR;                                                               ///< Command register,                              offset: 0x04
    __IO u32 SR;                                                                ///< <Status register,                              offset: 0x08
    __IO u32 IR;                                                                ///< Interrupt register,                            offset: 0x0c
    __IO u32 ACR;                                                               ///< Acceptance Code register,                      offset: 0x10
    __IO u32 AMR;                                                               ///< Acceptance Mask register,                      offset: 0x14
    __IO u32 BTR0;                                                              ///< Bus Timing register 0,                         offset: 0x18
    __IO u32 BTR1;                                                              ///< Bus Timing register 1,                         offset: 0x1C
    __IO u32  RESERVED0;
    __IO u32  RESERVED1;
    __IO u32 TXID0;                                                             ///< Send ID register 0,                            offset: 0x28
    __IO u32 TXID1;                                                             ///< Send ID register 1,                            offset: 0x2c
    __IO u32 TXDR0;                                                             ///< Send Data register 0,                          offset: 0x30
    __IO u32 TXDR1;                                                             ///< Send Data register 1,                          offset: 0x34
    __IO u32 TXDR2;                                                             ///< Send Data register 2,                          offset: 0x38
    __IO u32 TXDR3;                                                             ///< Send Data register 3,                          offset: 0x3c
    __IO u32 TXDR4;                                                             ///< Send Data register 4,                          offset: 0x40
    __IO u32 TXDR5;                                                             ///< Send Data register 5,                          offset: 0x44
    __IO u32 TXDR6;                                                             ///< Send Data register 6,                          offset: 0x48
    __IO u32 TXDR7;                                                             ///< Send Data register 7,                          offset: 0x4c
    __IO u32 RXID0;                                                             ///< Mode register,                                 offset: 0x50
    __IO u32 RXID1;                                                             ///< Mode register,                                 offset: 0x54
    __IO u32 RXDR0;                                                             ///< Mode register,                                 offset: 0x58
    __IO u32 RXDR1;                                                             ///< Mode register,                                 offset: 0x5C
    __IO u32 RXDR2;                                                             ///< Mode register,                                 offset: 0x60
    __IO u32 RXDR3;                                                             ///< Mode register,                                 offset: 0x64
    __IO u32 RXDR4;                                                             ///< Mode register,                                 offset: 0x68
    __IO u32 RXDR5;                                                             ///< Mode register,                                 offset: 0x6c
    __IO u32 RXDR6;                                                             ///< Mode register,                                 offset: 0x70
    __IO u32 RXDR7;                                                             ///< Mode register,                                 offset: 0x74
    __IO u32 RESERVED2;
    __IO u32 CDR;                                                               ///< Clock Divider register,                        offset: 0x7c
}CAN_TypeDef;

////////////////////////////////////////////////////////////////////////////////
/// @brief CAN Peli
////////////////////////////////////////////////////////////////////////////////
typedef struct {
    __IO u32 MOD;                                                               ///< Mode register,                                 offset: 0x00
    __IO u32 CMR;                                                               ///< Command register,                              offset: 0x04
    __IO u32 SR;                                                                ///< Status register,                               offset: 0x08
    __IO u32 IR;                                                                ///< Interrupt Enable register,                     offset: 0x0c
    __IO u32 IER;                                                               ///< Mode register,                                 offset: 0x10
    __IO u32 RESERVED0;
    __IO u32 BTR0;                                                              ///< Bus Timing register 0,                         offset: 0x18
    __IO u32 BTR1;                                                              ///< Bus Timing register 1,                         offset: 0x1C
    __IO u32 RESERVED1;
    __IO u32 RESERVED2;
    __IO u32 RESERVED3;
    __IO u32 ALC;                                                               ///< Arbitration Lost Capture register,             offset: 0x2c
    __IO u32 ECC;                                                               ///< Error Code Capture register,                   offset: 0x30
    __IO u32 EWLR;                                                              ///< Error Warning Limit register,                  offset: 0x34
    __IO u32 RXERR;                                                             ///< RX Error Counter register,                     offset: 0x38
    __IO u32 TXERR;                                                             ///< TX Error Counter register,                     offset: 0x3c
    __IO u32 FF;                                                                ///< Frame Format register,                         offset: 0x40
    __IO u32 ID0;                                                               ///< ID register 0,                                 offset: 0x44
    __IO u32 ID1;                                                               ///< ID register 1,                                 offset: 0x48
    __IO u32 DATA0;                                                             ///< Data register 0,                               offset: 0x4c
    __IO u32 DATA1;                                                             ///< Data register 1,                               offset: 0x50
    __IO u32 DATA2;                                                             ///< Data register 2,                               offset: 0x54
    __IO u32 DATA3;                                                             ///< Data register 3,                               offset: 0x58
    __IO u32 DATA4;                                                             ///< Data register 4,                               offset: 0x5c
    __IO u32 DATA5;                                                             ///< Data register 5,                               offset: 0x60
    __IO u32 DATA6;                                                             ///< Data register 6,                               offset: 0x64
    __IO u32 DATA7;                                                             ///< Data register 7,                               offset: 0x68
    __IO u32 DATA8;                                                             ///< Data register 8,                               offset: 0x6c
    __IO u32 DATA9;                                                             ///< Data register 9,                               offset: 0x70
    __IO u32 RMC;
    __IO u32 RBSA;
    __IO u32 CDR;                                                               ///< Clock Divider register                         offset: 0x7c
}CAN_Peli_TypeDef;
#endif

////////////////////////////////////////////////////////////////////////////////
/// @brief Comparators Register Structure Definition
////////////////////////////////////////////////////////////////////////////////
typedef struct {
#if defined(__MM3N1) || defined(__MM0N1)
    __IO u32 COMP1_CSR;                                                         ///< COMP1 Control Status Register                  offset: 0x00
    __IO u32 COMP2_CSR;                                                         ///< COMP2 Control Status Register                  offset: 0x04
#endif

