mm32/MM32_FDS/library/startup/inc/_mm32.h
#if defined(__MM0Q1)
    __IO u32 COMP1_CSR;                                                         ///< COMP1 Control Status Register                  offset: 0x00
#endif
#if defined(__MM0P1)
    __IO u32 COMP4_CSR;                                                         ///< COMP4 Control Status Register                  offset: 0x00
#endif

#if defined(__MM0P1)
    __IO u32 COMP5_CSR;                                                         ///< COMP5 Control Status Register                  offset: 0x04
    __IO u32 COMP1_CSR;                                                         ///< COMP1 Control Status Register                  offset: 0x08
    __IO u32 COMP2_CSR;                                                         ///< COMP2 Control Status Register                  offset: 0x0C
    __IO u32 RESERVED;
    __IO u32 COMP3_CSR;                                                         ///< COMP3 Control Status Register                  offset: 0x14
#else
    __IO u32 RESERVED0;
    __IO u32 RESERVED1;
    __IO u32 RESERVED2;
    __IO u32 RESERVED3;
    __IO u32 RESERVED4;
#endif
    __IO u32 COMP_CRV;                                                          ///< COMP external reference voltage register       offset: 0x18
    __IO u32 COMP4_POL;                                                         ///< COMP4 polling register                         offset: 0x1C
#if defined(__MM0P1)
    __IO u32 COMP5_POL;                                                         ///< COMP5 polling register                         offset: 0x20
#endif
} COMP_TypeDef;

////////////////////////////////////////////////////////////////////////////////
/// @brief CRC Register Structure Definition
////////////////////////////////////////////////////////////////////////////////
typedef struct {
    __IO u32   DR;                                                              ///< CRC data register,                             offset: 0x00
    __IO u32   IDR;                                                             ///< CRC independent data register,                 offset: 0x04
    __IO u32   CR;                                                              ///< CRC control register,                          offset: 0x08
} CRC_TypeDef;

////////////////////////////////////////////////////////////////////////////////
/// @brief CRS Register Structure Definition
////////////////////////////////////////////////////////////////////////////////
#if defined(__MM0N1)
typedef struct {
    __IO u32 CR;                                                                ///< Control Register                               offset: 0x00
    __IO u32 CFGR;                                                              ///< Configuration Register                         offset: 0x04
    __IO u32 ISR;                                                               ///< Interrupt and Status Register                  offset: 0x08
    __IO u32 ICR;                                                               ///< Interrupt Flag Clear Register                  offset: 0x0C
} CRS_TypeDef;
#endif

////////////////////////////////////////////////////////////////////////////////
/// @brief Digital to analog converter register
////////////////////////////////////////////////////////////////////////////////
#if defined(__MM3N1)
typedef struct {
    __IO u32 CR;                                                                ///<  DAC control register,                         offset: 0x00
    __IO u32 SWTRIGR;                                                           ///<  DAC software trigger register,                offset: 0x04
    __IO u32 DHR12R1;                                                           ///<  Channel 1 12-bit right align data register,   offset: 0x08
    __IO u32 DHR12L1;                                                           ///<  Channel 1 12-bit left align data register,    offset: 0x0C
    __IO u32 DHR8R1;                                                            ///<  Channel 1 8-bit right align data register,    offset: 0x10
    __IO u32 DHR12R2;                                                           ///<  Channel 2 12-bit right align data register,   offset: 0x14
    __IO u32 DHR12L2;                                                           ///<  Channel 2 12-bit left align data register,    offset: 0x18
    __IO u32 DHR8R2;                                                            ///<  Channel 2 8-bit right align data register,    offset: 0x1C
    __IO u32 DHR12RD;                                                           ///<  Dual channel 12-bit right align data register,offset: 0x20
    __IO u32 DHR12LD;                                                           ///<  Dual channel 12-bit left align data register, offset: 0x24
    __IO u32 DHR8RD;                                                            ///<  Dual channel 8-bit right align data register, offset: 0x28
    __IO u32 DOR1;                                                              ///<  Channel 1 output register,                    offset: 0x2C
    __IO u32 DOR2;                                                              ///<  Channel 2 output register,                    offset: 0x30
} DAC_TypeDef;
#endif

////////////////////////////////////////////////////////////////////////////////
/// @brief DEBUG Registers Structure Definition
////////////////////////////////////////////////////////////////////////////////
typedef struct {
    __IO u32 IDCODE;                                                            ///< Code ID                                        offset: 0x00
    __IO u32 CR;                                                                ///< Control Register                               offset: 0x04
}DBGMCU_TypeDef;

////////////////////////////////////////////////////////////////////////////////
/// @brief DIV Register Structure Definition
////////////////////////////////////////////////////////////////////////////////
#if defined(__MM0P1) || defined(__MM0Q1)
typedef struct {
    __IO u32 DVDR;                                                              ///< Divider data register,                         offset: 0x00
    __IO u32 DVSR;                                                              ///< Divisor register,                              offset: 0x04
    __IO u32 QUOTR;                                                             ///< Quotient register,                             offset: 0x08
    __IO u32 RMDR;                                                              ///< Remainder register,                            offset: 0x0C
    __IO u32 SR;                                                                ///< Status register,                               offset: 0x10
    __IO u32 CR;                                                                ///< Control register,                              offset: 0x14
} DIV_TypeDef;
#endif

////////////////////////////////////////////////////////////////////////////////
/// @brief DMA Register Structure Definition
////////////////////////////////////////////////////////////////////////////////
typedef struct {
    __IO u32 CCR;                                                               ///< DMA channel x configuration register           offset: 0x00
    __IO u32 CNDTR;                                                             ///< DMA channel x number of data register          offset: 0x04
    __IO u32 CPAR;                                                              ///< DMA channel x peripheral address register      offset: 0x08
    __IO u32 CMAR;                                                              ///< DMA channel x memory address register          offset: 0x0C
} DMA_Channel_TypeDef;

