mm32/MM32_FDS/library/startup/inc/_mm32.h
#if defined(__MM0P1) || defined(__MM0Q1)
    __IO u32 RXADDR;                                                            ///< Receive Address Register,                      offset: 0x28
    __IO u32 RXMASK;                                                            ///< Receive Address Mask Register,                 offset: 0x2C
    __IO u32 SCR;                                                               ///< Smart Card Register,                           offset: 0x30
#endif
} UART_TypeDef;

////////////////////////////////////////////////////////////////////////////////
/// @brief USB Register Structure Definition
////////////////////////////////////////////////////////////////////////////////
#if defined(__MM3N1) || defined(__MM0N1)
typedef struct {
    __IO u32 TOP;                                                               ///< Top Register                                   offset: 0x00
    __IO u32 INT_STATE;                                                         ///< Interrupt State Register                       offset: 0x04
    __IO u32 EP_INT_STATE;                                                      ///< Endpoint Interrupt State Register              offset: 0x08
    __IO u32 EP0_INT_STATE;                                                     ///< EP0 Interrupt State Register                   offset: 0x0C
    __IO u32 INT_EN;                                                            ///< Interrupt Enable Register                      offset: 0x10
    __IO u32 EP_INT_EN;                                                         ///< Endpoint Interrupt Enable Register             offset: 0x14
    __IO u32 EP0_INT_EN;                                                        ///< EP0 Interrupt Enable Register                  offset: 0x18

    __IO u32 RESERVED0;                                                         ///< Reserved                                       offset: 0x1C

    __IO u32 EP1_INT_STATE;                                                     ///< EP1 Interrupt State Register                   offset: 0x20
    __IO u32 EP2_INT_STATE;                                                     ///< EP2 Interrupt State Register                   offset: 0x24
    __IO u32 EP3_INT_STATE;                                                     ///< EP3 Interrupt State Register                   offset: 0x28
    __IO u32 EP4_INT_STATE;                                                     ///< EP4 Interrupt State Register                   offset: 0x2C

    __IO u32 RESERVED1[4];                                                      ///< Reserved                                       offset: 0x30

    __IO u32 EP1_INT_EN;                                                        ///< EP0 Interrupt Enable Register                  offset: 0x40
    __IO u32 EP2_INT_EN;                                                        ///< EP0 Interrupt Enable Register                  offset: 0x44
    __IO u32 EP3_INT_EN;                                                        ///< EP0 Interrupt Enable Register                  offset: 0x48
    __IO u32 EP4_INT_EN;                                                        ///< EP0 Interrupt Enable Register                  offset: 0x4C

    __IO u32 RESERVED5[4];                                                      ///< Reserved                                       offset: 0x50

    __IO u32 ADDR;                                                              ///< USB Address Register                           offset: 0x60
    __IO u32 EP_EN;                                                             ///< Endpoint Enable Register                       offset: 0x64

    __IO u32 RESERVED9[4];                                                      ///< Reserved                                       offset: 0x68

    __IO u32 TOG_CTRL1_4;                                                       ///< Toggle Control Register                        offset: 0x78

    __IO u32 RESERVED13;                                                        ///< Reserved                                       offset: 0x7C

    __IO u32 SETUP0;                                                            ///< SETUP Packet Byte 0 Register                   offset: 0x80
    __IO u32 SETUP1;                                                            ///< SETUP Packet Byte 1 Register                   offset: 0x84
    __IO u32 SETUP2;                                                            ///< SETUP Packet Byte 2 Register                   offset: 0x88
    __IO u32 SETUP3;                                                            ///< SETUP Packet Byte 3 Register                   offset: 0x8C
    __IO u32 SETUP4;                                                            ///< SETUP Packet Byte 4 Register                   offset: 0x90
    __IO u32 SETUP5;                                                            ///< SETUP Packet Byte 5 Register                   offset: 0x94
    __IO u32 SETUP6;                                                            ///< SETUP Packet Byte 6 Register                   offset: 0x98
    __IO u32 SETUP7;                                                            ///< SETUP Packet Byte 7 Register                   offset: 0x9C
    __IO u32 PACKET_SIZE0;                                                      ///< DMA Max Packet Size 0 Register                 offset: 0xA0
    __IO u32 PAKCET_SIZE1;                                                      ///< DMA Max Packet Size 1 Register                 offset: 0xA4

    __IO u32 RESERVED14[22];                                                    ///< Reserved                                       offset: 0xA8

    __IO u32 EP0_AVIL;                                                          ///< EP0 Available Data Register                    offset: 0x100
    __IO u32 EP1_AVIL;                                                          ///< EP1 Available Data Register                    offset: 0x104
    __IO u32 EP2_AVIL;                                                          ///< EP2 Available Data Register                    offset: 0x108
    __IO u32 EP3_AVIL;                                                          ///< EP3 Available Data Register                    offset: 0x10C
    __IO u32 EP4_AVIL;                                                          ///< EP4 Available Data Register                    offset: 0x110

    __IO u32 RESERVED36[11];                                                    ///< Reserved                                       offset: 0x114

    __IO u32 EP0_CTRL;                                                          ///< EP0 Control Register                           offset: 0x140
    __IO u32 EP1_CTRL;                                                          ///< EP1 Control Register                           offset: 0x144
    __IO u32 EP2_CTRL;                                                          ///< EP2 Control Register                           offset: 0x148
    __IO u32 EP3_CTRL;                                                          ///< EP3 Control Register                           offset: 0x14C
    __IO u32 EP4_CTRL;                                                          ///< EP4 Control Register                           offset: 0x150

    __IO u32 RESERVED47[3];                                                     ///< Reserved                                       offset: 0x154

    __IO u32 EP0_FIFO;                                                          ///< EP0 FIFO Register                              offset: 0x160
    __IO u32 EP1_FIFO;                                                          ///< EP1 FIFO Register                              offset: 0x164
    __IO u32 EP2_FIFO;                                                          ///< EP2 FIFO Register                              offset: 0x168
    __IO u32 EP3_FIFO;                                                          ///< EP3 FIFO Register                              offset: 0x16C
    __IO u32 EP4_FIFO;                                                          ///< EP4 FIFO Register                              offset: 0x170

    __IO u32 RESERVED50[4];                                                     ///< Reserved                                       offset: 0x174

