mm32/MM32_FDS/library/startup/inc/_mm32.h
#if defined(__MM0P1) || defined(__MM0Q1)
////////////////////////////////////////////////////////////////////////////////
/// @brief PWM type pointer Definition
////////////////////////////////////////////////////////////////////////////////
#define PWM                             ((PWM_TypeDef*) PWM_BASE)
#endif

////////////////////////////////////////////////////////////////////////////////
/// @brief PWR type pointer Definition
////////////////////////////////////////////////////////////////////////////////
#define PWR                             ((PWR_TypeDef*) PWR_BASE)

////////////////////////////////////////////////////////////////////////////////
/// @brief RCC type pointer Definition
////////////////////////////////////////////////////////////////////////////////
#define RCC                             ((RCC_TypeDef*) RCC_BASE)

////////////////////////////////////////////////////////////////////////////////
/// @brief RTC type pointer Definition
////////////////////////////////////////////////////////////////////////////////
#if defined(__MM3N1) || defined(__MM3O1)
    #define RTC                         ((RTC_TypeDef*)RTC_BASE)
#endif

////////////////////////////////////////////////////////////////////////////////
/// @brief SPI type pointer Definition
////////////////////////////////////////////////////////////////////////////////
#define SPI2                            ((SPI_TypeDef*) SPI2_BASE)

#if defined(__MM3N1) || defined(__MM0N1) || defined(__MM0P1)
    #define SPI1                        ((SPI_TypeDef*) SPI1_BASE)
#endif

////////////////////////////////////////////////////////////////////////////////
/// @brief SQRT type pointer Definition
////////////////////////////////////////////////////////////////////////////////
#if defined(__MM0P1) || defined(__MM0Q1)
    #define SQRT                        ((SQRT_TypeDef*) SQRT_BASE)
#endif

////////////////////////////////////////////////////////////////////////////////
/// @brief TIM type pointer Definition
////////////////////////////////////////////////////////////////////////////////
#define TIM1                            ((TIM_TypeDef*) TIM1_BASE)
#define TIM2                            ((TIM_TypeDef*) TIM2_BASE)
#define TIM3                            ((TIM_TypeDef*) TIM3_BASE)

#if defined(__MM3N1) || defined(__MM3O1)
    #define TIM4                        ((TIM_TypeDef*) TIM4_BASE)
#endif

#if defined(__MM3O1)
    #define TIM5                        ((TIM_TypeDef*) TIM5_BASE)
    #define TIM6                        ((TIM_TypeDef*) TIM6_BASE)
    #define TIM7                        ((TIM_TypeDef*) TIM7_BASE)
#endif

#if defined(__MM3O1) || defined(__MM0P1)
    #define TIM8                        ((TIM_TypeDef*) TIM8_BASE)
#endif

#if defined(__MM0N1) || defined(__MM0P1) || defined(__MM0Q1)
    #define TIM14                       ((TIM_TypeDef*) TIM14_BASE)
#endif

#if defined(__MM0N1) || defined(__MM0P1) || defined(__MM0Q1)
    #define TIM16                       ((TIM_TypeDef*) TIM16_BASE)
    #define TIM17                       ((TIM_TypeDef*) TIM17_BASE)
#endif

////////////////////////////////////////////////////////////////////////////////
/// @brief UART type pointer Definition
////////////////////////////////////////////////////////////////////////////////
#define UART1                           ((UART_TypeDef*) UART1_BASE)
#define UART2                           ((UART_TypeDef*) UART2_BASE)

#if defined(__MM3N1)
    #define UART3                       ((UART_TypeDef*) UART3_BASE)
#endif

////////////////////////////////////////////////////////////////////////////////
/// @brief USBD type pointer Definition
////////////////////////////////////////////////////////////////////////////////
#if defined(__MM3N1) || defined(__MM0N1)
    #define USB                         ((USB_TypeDef*) USB_BASE )
#endif

////////////////////////////////////////////////////////////////////////////////
/// @brief WWDG type pointer Definition
////////////////////////////////////////////////////////////////////////////////
#define WWDG                            ((WWDG_TypeDef*) WWDG_BASE)

////////////////////////////////////////////////////////////////////////////////
/// @brief ADC_DR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define  ADC_DR_DATA_Pos                (0)
#define  ADC_DR_DATA                    (0xFFFFU << ADC_DR_DATA_Pos)            ///< ADC 12bit convert data

#define  ADC_DR_CH_Pos                  (16)
#define  ADC_DR_CH                      (0x0FU <<  ADC_DR_CH_Pos)               ///< CHANNELSEL[19:16] (ADC current channel convert data)

#define  ADC_DR_CH0                     (0x00U << ADC_DR_CH_Pos)                ///< ADC Channal select  0
#define  ADC_DR_CH1                     (0x01U << ADC_DR_CH_Pos)                ///< ADC Channal select  1
#define  ADC_DR_CH2                     (0x02U << ADC_DR_CH_Pos)                ///< ADC Channal select  2
#define  ADC_DR_CH3                     (0x03U << ADC_DR_CH_Pos)                ///< ADC Channal select  3
#define  ADC_DR_CH4                     (0x04U << ADC_DR_CH_Pos)                ///< ADC Channal select  4
#define  ADC_DR_CH5                     (0x05U << ADC_DR_CH_Pos)                ///< ADC Channal select  5
#define  ADC_DR_CH6                     (0x06U << ADC_DR_CH_Pos)                ///< ADC Channal select  6
#define  ADC_DR_CH7                     (0x07U << ADC_DR_CH_Pos)                ///< ADC Channal select  7

#if defined(__MM3N1)
    #define  ADC_DR_Sensor              (0x08U << ADC_DR_CH_Pos)                ///< ADC Channal select  8
#endif

#if defined(__MM0N1) || defined(__MM0P1) || defined(__MM0Q1)
    #define  ADC_DR_CH8                 (0x08U << ADC_DR_CH_Pos)                ///< ADC Channal select  8
    #define  ADC_DR_CH9                 (0x09U << ADC_DR_CH_Pos)                ///< ADC Channal select  9
    #define  ADC_DR_TempSensor          (0x0EU << ADC_DR_CH_Pos)                ///< ADC Channal select  14
    #define  ADC_DR_VoltRef             (0x0FU << ADC_DR_CH_Pos)                ///< ADC Channal select  15
#endif

