mm32/MM32_FDS/library/startup/inc/_mm32.h
#if defined(__MM0P1) || defined(__MM0Q1)
    #define ADC_CR_TRGSEL_H_Pos         (17)
    #define ADC_CR_TRGSEL_L_Pos         (4)
    #define ADC_CR_TRGSEL               ((0x03U << ADC_CR_TRGSEL_H_Pos) + (0x07U << ADC_CR_TRGSEL_L_Pos))   ///< TRGSEL[6:4][18:17] ADC external trigger source select
    #define ADC_CR_T1_CC1               (0x00U << ADC_CR_TRGSEL_L_Pos)          ///< The external trigger source of the ADC is T1_CC1
    #define ADC_CR_T1_CC2               (0x01U << ADC_CR_TRGSEL_L_Pos)          ///< The external trigger source of the ADC is T1_CC2
    #define ADC_CR_T1_CC3               (0x02U << ADC_CR_TRGSEL_L_Pos)          ///< The external trigger source of the ADC is T1_CC3
    #define ADC_CR_T2_CC2               (0x03U << ADC_CR_TRGSEL_L_Pos)          ///< The external trigger source of the ADC is T2_CC2
    #define ADC_CR_T3_TRIG              (0x04U << ADC_CR_TRGSEL_L_Pos)          ///< The external trigger source of the ADC is T3_TRIG
    #define ADC_CR_T1_CC4_CC5           (0x05U << ADC_CR_TRGSEL_L_Pos)          ///< The external trigger source of the ADC is T1_CC4_CC5
    #define ADC_CR_T3_CC1               (0x06U << ADC_CR_TRGSEL_L_Pos)          ///< The external trigger source of the ADC is T3_CC1
    #define ADC_CR_EXTI_11              (0x07U << ADC_CR_TRGSEL_L_Pos)          ///< The external trigger source of the ADC is EXTI_11
    #define ADC_CR_T1_TRIG              ((0x01U << ADC_CR_TRGSEL_H_Pos) + (0x00U << ADC_CR_TRGSEL_L_Pos))   ///< The external trigger source of the ADC is T1_TRIG
    #define ADC_CR_T8_CC4               ((0x01U << ADC_CR_TRGSEL_H_Pos) + (0x01U << ADC_CR_TRGSEL_L_Pos))   ///< The external trigger source of the ADC is T8_CC4
    #define ADC_CR_T8_CC4_CC5           ((0x01U << ADC_CR_TRGSEL_H_Pos) + (0x02U << ADC_CR_TRGSEL_L_Pos))   ///< The external trigger source of the ADC is T8_CC4_CC5
    #define ADC_CR_T2_CC1               ((0x01U << ADC_CR_TRGSEL_H_Pos) + (0x03U << ADC_CR_TRGSEL_L_Pos))   ///< The external trigger source of the ADC is T2_CC1
    #define ADC_CR_T3_CC4               ((0x01U << ADC_CR_TRGSEL_H_Pos) + (0x04U << ADC_CR_TRGSEL_L_Pos))   ///< The external trigger source of the ADC is T3_CC4
    #define ADC_CR_T2_TRIG              ((0x01U << ADC_CR_TRGSEL_H_Pos) + (0x05U << ADC_CR_TRGSEL_L_Pos))   ///< The external trigger source of the ADC is T2_TRIG
    #define ADC_CR_T8_CC5               ((0x01U << ADC_CR_TRGSEL_H_Pos) + (0x06U << ADC_CR_TRGSEL_L_Pos))   ///< The external trigger source of the ADC is T8_CC5
    #define ADC_CR_EXTI_15              ((0x01U << ADC_CR_TRGSEL_H_Pos) + (0x07U << ADC_CR_TRGSEL_L_Pos))   ///< The external trigger source of the ADC is EXTI_15
    #define ADC_CR_TIM1_CC4             ((0x02U << ADC_CR_TRGSEL_H_Pos) + (0x00U << ADC_CR_TRGSEL_L_Pos))   ///< The external trigger source of the ADC is TIM1_CC4
    #define ADC_CR_TIM1_CC5             ((0x02U << ADC_CR_TRGSEL_H_Pos) + (0x01U << ADC_CR_TRGSEL_L_Pos))   ///< The external trigger source of the ADC is TIM1_CC5
    #define ADC_CR_SCANDIR_Pos          (16)
    #define ADC_CR_TRGSHIFT_Pos         (19)
    #define ADC_CR_SCANDIR              (0x01U << ADC_CR_SCANDIR_Pos)           ///< ADC scan direction
    #define ADC_CR_TRGSHIFT             (0x07U << ADC_CR_TRGSHIFT_Pos)          ///< External trigger shift sample
    #define ADC_CR_TRGSHIFT_0           (0x00U << ADC_CR_TRGSHIFT_Pos)          ///< No shift
    #define ADC_CR_TRGSHIFT_4           (0x01U << ADC_CR_TRGSHIFT_Pos)          ///< Shift 4 period
    #define ADC_CR_TRGSHIFT_16          (0x02U << ADC_CR_TRGSHIFT_Pos)          ///< Shift 16 period
    #define ADC_CR_TRGSHIFT_32          (0x03U << ADC_CR_TRGSHIFT_Pos)          ///< Shift 32 period
    #define ADC_CR_TRGSHIFT_64          (0x04U << ADC_CR_TRGSHIFT_Pos)          ///< Shift 64 period
    #define ADC_CR_TRGSHIFT_128         (0x05U << ADC_CR_TRGSHIFT_Pos)          ///< Shift 128 period
    #define ADC_CR_TRGSHIFT_256         (0x06U << ADC_CR_TRGSHIFT_Pos)          ///< Shift 256 period
    #define ADC_CR_TRGSHIFT_512         (0x07U << ADC_CR_TRGSHIFT_Pos)          ///< Shift 512 period
    #define ADC_CR_CALIBEN_Pos          (22)
    #define ADC_CR_CALIBSEL_Pos         (23)
    #define ADC_CR_CALIBEN              (0x01U << ADC_CR_CALIBEN_Pos)           ///< Self-calibration enable
    #define ADC_CR_CALIBSEL             (0x01U << ADC_CR_CALIBSEL_Pos)          ///< Self-calibration voltage selection
#endif

////////////////////////////////////////////////////////////////////////////////
/// @brief ADC_CHSR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define  ADC_CHSR_CH0EN_Pos             (0)
#define  ADC_CHSR_CH0EN                 (0x01U << ADC_CHSR_CH0EN_Pos)           ///< Enable ADC channel 0
#define  ADC_CHSR_CH1EN_Pos             (1)
#define  ADC_CHSR_CH1EN                 (0x01U << ADC_CHSR_CH1EN_Pos)           ///< Enable ADC channel 1
#define  ADC_CHSR_CH2EN_Pos             (2)
#define  ADC_CHSR_CH2EN                 (0x01U << ADC_CHSR_CH2EN_Pos)           ///< Enable ADC channel 2
#define  ADC_CHSR_CH3EN_Pos             (3)
#define  ADC_CHSR_CH3EN                 (0x01U << ADC_CHSR_CH3EN_Pos)           ///< Enable ADC channel 3
#define  ADC_CHSR_CH4EN_Pos             (4)
#define  ADC_CHSR_CH4EN                 (0x01U << ADC_CHSR_CH4EN_Pos)           ///< Enable ADC channel 4
#define  ADC_CHSR_CH5EN_Pos             (5)
#define  ADC_CHSR_CH5EN                 (0x01U << ADC_CHSR_CH5EN_Pos)           ///< Enable ADC channel 5
#define  ADC_CHSR_CH6EN_Pos             (6)
#define  ADC_CHSR_CH6EN                 (0x01U << ADC_CHSR_CH6EN_Pos)           ///< Enable ADC channel 6
#define  ADC_CHSR_CH7EN_Pos             (7)
#define  ADC_CHSR_CH7EN                 (0x01U << ADC_CHSR_CH7EN_Pos)           ///< Enable ADC channel 7

#if defined(__MM3N1)
    #define  ADC_CHSR_CHTVEN_Pos        (8)
    #define  ADC_CHSR_CHTVEN            (0x01U << ADC_CHSR_CHTVEN_Pos)          ///< Enable ADC sensor
    #define  ADC_CHSR_CHALL             (0x01FFU)                               ///< Enable ADC all channel
#endif

