mm32/MM32_FDS/library/startup/inc/_mm32.h
#if defined(__MM0N1) || defined(__MM0P1) || defined(__MM0Q1)
    #define  ADC_CHSR_CH8EN_Pos         (8)
    #define  ADC_CHSR_CH8EN             (0x01U << ADC_CHSR_CH8EN_Pos)           ///< Enable ADC channel 8
    #define  ADC_CHSR_CH9EN_Pos         (9)
    #define  ADC_CHSR_CH9EN             (0x01U << ADC_CHSR_CH9EN_Pos)           ///< Enable ADC channel 9
    #define  ADC_CHSR_CHTSEN_Pos        (14)
    #define  ADC_CHSR_CHTSEN            (0x01U << ADC_CHSR_CHTSEN_Pos)          ///< Enable Temperature Sensor
    #define  ADC_CHSR_CHVSEN_Pos        (15)
    #define  ADC_CHSR_CHVSEN            (0x01U << ADC_CHSR_CHVSEN_Pos)          ///< Enable Voltage Sensor
#endif

#if defined(__MM0N1)
    #define  ADC_CHSR_CHALL             (0xC3FFU)                               ///< Enable ADC all channel
#endif

#if defined(__MM0P1) || defined(__MM0Q1)
    #define  ADC_CHSR_CH10EN_Pos        (10)
    #define  ADC_CHSR_CH10EN            (0x01U << ADC_CHSR_CH10EN_Pos)          ///< Enable ADC channel 10
    #define  ADC_CHSR_CH11EN_Pos        (11)
    #define  ADC_CHSR_CH11EN            (0x01U << ADC_CHSR_CH11EN_Pos)          ///< Enable ADC channel 11
    #define  ADC_CHSR_CHCALIB_Pos       (13)
    #define  ADC_CHSR_CHCALIB           (0x01U << ADC_CHSR_CHCALIB_Pos)         ///< Enable ADC internal self-calibration channel
    #define  ADC_CHSR_CHALL             (0xEFFFU)                               ///< Enable ADC all channel
#endif

////////////////////////////////////////////////////////////////////////////////
/// @brief ADC_CMPR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define  ADC_CMPR_CMPLDATA_Pos          (0)
#define  ADC_CMPR_CMPLDATA              (0x0FFFU << ADC_CMPR_CMPLDATA_Pos)      ///< ADC 12bit window compare DOWN LEVEL DATA
#define  ADC_CMPR_CMPHDATA_Pos          (16)
#define  ADC_CMPR_CMPHDATA              (0x0FFFU << ADC_CMPR_CMPHDATA_Pos)      ///< ADC 12bit window compare UP LEVEL DATA

////////////////////////////////////////////////////////////////////////////////
/// @brief ADC_SR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define  ADC_SR_ADIF_Pos                (0)
#define  ADC_SR_ADIF                    (0x01U << ADC_SR_ADIF_Pos)              ///< ADC convert complete flag
#define  ADC_SR_ADWIF_Pos               (1)
#define  ADC_SR_ADWIF                   (0x01U << ADC_SR_ADWIF_Pos)             ///< ADC compare flag
#define  ADC_SR_BUSY_Pos                (2)
#define  ADC_SR_BUSY                    (0x01U << ADC_SR_BUSY_Pos)              ///< ADC busy flag
#define  ADC_SR_CH_Pos                  (4)
#define  ADC_SR_                        (0x0FU << ADC_SR_CH_Pos)                ///< CHANNEL[7:4] ADC current channel
#define  ADC_SR_CH0                     (0x00U << ADC_SR_CH_Pos)                ///< Channel 0 is the current conversion channel
#define  ADC_SR_CH1                     (0x01U << ADC_SR_CH_Pos)                ///< Channel 1 is the current conversion channel
#define  ADC_SR_CH2                     (0x02U << ADC_SR_CH_Pos)                ///< Channel 2 is the current conversion channel
#define  ADC_SR_CH3                     (0x03U << ADC_SR_CH_Pos)                ///< Channel 3 is the current conversion channel
#define  ADC_SR_CH4                     (0x04U << ADC_SR_CH_Pos)                ///< Channel 4 is the current conversion channel
#define  ADC_SR_CH5                     (0x05U << ADC_SR_CH_Pos)                ///< Channel 5 is the current conversion channel
#define  ADC_SR_CH6                     (0x06U << ADC_SR_CH_Pos)                ///< Channel 6 is the current conversion channel
#define  ADC_SR_CH7                     (0x07U << ADC_SR_CH_Pos)                ///< Channel 7 is the current conversion channel
#define  ADC_SR_CH8                     (0x08U << ADC_SR_CH_Pos)                ///< Channel 8 is the current conversion channel
#define  ADC_SR_CH9                     (0x09U << ADC_SR_CH_Pos)                ///< Channel 9 is the current conversion channel
#define  ADC_SR_CH10                    (0x0AU << ADC_SR_CH_Pos)                ///< Channel 10 is the current conversion channel
#define  ADC_SR_CH11                    (0x0BU << ADC_SR_CH_Pos)                ///< Channel 11 is the current conversion channel
#define  ADC_SR_CH13                    (0x0DU << ADC_SR_CH_Pos)                ///< Channel 13 is the current conversion channel
#define  ADC_SR_CH14                    (0x0EU << ADC_SR_CH_Pos)                ///< Channel 14 is the current conversion channel
#define  ADC_SR_CH15                    (0x0FU << ADC_SR_CH_Pos)                ///< Channel 15 is the current conversion channel

#if defined(__MM3N1)
    #define  ADC_SR_VALID_Pos           (8)
    #define  ADC_SR_VALID               (0x01FFU << ADC_SR_VALID_Pos)           ///< VALID[16:9] ADC channel 0..8 valid flag
    #define  ADC_SR_OVERRUN_Pos         (20)
    #define  ADC_SR_OVERRUN             (0x01FFU << ADC_SR_OVERRUN_Pos)         ///< OVERRUN[28:20] ADC channel 0..8 data covered flag
#endif

#if defined(__MM0N1) || defined(__MM0P1) || defined(__MM0Q1)
    #define  ADC_SR_VALID_Pos           (8)
    #define  ADC_SR_VALID               (0x0FFFU << ADC_SR_VALID_Pos)           ///< VALID[19:8] ADC channel 0..11 valid flag
    #define  ADC_SR_OVERRUN_Pos         (20)
    #define  ADC_SR_OVERRUN             (0x0FFFU << ADC_SR_OVERRUN_Pos)         ///< OVERRUN[31:20] ADC channel 0..11 data covered flag
#endif

////////////////////////////////////////////////////////////////////////////////
/// @brief ADC_CHnDR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define  ADC_CHnDR_DATA_Pos             (0)
#define  ADC_CHnDR_DATA                 (0xFFFFU << ADC_CHnDR_DATA_Pos)         ///< ADC channel convert data
#define  ADC_CHnDR_OVERRUN_Pos          (20)
#define  ADC_CHnDR_OVERRUN              (0x01U << ADC_CHnDR_OVERRUN_Pos)        ///< ADC data covered flag
#define  ADC_CHnDR_VALID_Pos            (21)
#define  ADC_CHnDR_VALID                (0x01U << ADC_CHnDR_VALID_Pos)          ///< ADC data valid flag

