mm32/MM32_FDS/library/startup/inc/_mm32.h
////////////////////////////////////////////////////////////////////////////////
/// @brief CAN_AMRn register Bit definition
////////////////////////////////////////////////////////////////////////////////
    #define CAN_AMRn_AM_Pos             (0)
    #define CAN_AMRn_AM                 (0xFFU << CAN_AMRn_AM_Pos)              ///< CAN acceptance mask

////////////////////////////////////////////////////////////////////////////////
/// @brief CAN_BTR0 register Bit definition
////////////////////////////////////////////////////////////////////////////////
    #define CAN_BTR0_BRP_Pos            (0)
    #define CAN_BTR0_BRP                (0x003FU << CAN_BTR0_BRP_Pos)           ///< CAN baud rate prescaler
    #define CAN_BTR0_SJW_Pos            (6)
    #define CAN_BTR0_SJW                (0x03U << CAN_BTR0_SJW_Pos)             ///< CAN synchronization jump width

////////////////////////////////////////////////////////////////////////////////
/// @brief CAN_ALC register Bit definition
////////////////////////////////////////////////////////////////////////////////
    #define CAN_ALC_BITNO_Pos           (0)
    #define CAN_ALC_BITNO               (0x001FU << CAN_ALC_BITNO_Pos)          ///< CAN bit number

////////////////////////////////////////////////////////////////////////////////
/// @brief CAN_ECC register Bit definition
////////////////////////////////////////////////////////////////////////////////
    #define CAN_ECC_SEG_Pos             (0)
    #define CAN_ECC_SEG                 (0x001FU <<CAN_ECC_SEG_Pos)             ///< CAN error code capture
    #define CAN_ECC_DIR_Pos             (5)
    #define CAN_ECC_DIR                 (0x01U << CAN_ECC_DIR_Pos)              ///< CAN direction
    #define CAN_ECC_ERRC_Pos            (6)
    #define CAN_ECC_ERRC                (0x03U << CAN_ECC_ERRC_Pos)             ///< CAN error code

////////////////////////////////////////////////////////////////////////////////
/// @brief CAN_EWLR register Bit definition
////////////////////////////////////////////////////////////////////////////////
    #define CAN_EWLR_EWL_Pos            (0)
    #define CAN_EWLR_EWL                (0x00FFU << CAN_EWLR_EWL_Pos)           ///< CAN programmable error warning limit

////////////////////////////////////////////////////////////////////////////////
/// @brief CAN_RXERR register Bit definition
////////////////////////////////////////////////////////////////////////////////
    #define CAN_RXERR_RXERR_Pos         (0)
    #define CAN_RXERR_RXERR             (0x00FFU << CAN_RXERR_RXERR_Pos)        ///< CAN RX error counter register

////////////////////////////////////////////////////////////////////////////////
/// @brief CAN_TXERR register Bit definition
////////////////////////////////////////////////////////////////////////////////
    #define CAN_TXERR_TXERR_Pos         (0)
    #define CAN_TXERR_TXERR             (0x00FFU << CAN_TXERR_TXERR_Pos)        ///< CAN TX error counter register

////////////////////////////////////////////////////////////////////////////////
/// @brief CAN_FF register Bit definition
////////////////////////////////////////////////////////////////////////////////
    #define CAN_FF_DLC_0_Pos            (0)
    #define CAN_FF_DLC_0                (0x01U << CAN_FF_DLC_0_Pos)             ///< CAN data length code bit
    #define CAN_FF_DLC_1_Pos            (1)
    #define CAN_FF_DLC_1                (0x01U << CAN_FF_DLC_1_Pos)             ///< CAN data length code bit
    #define CAN_FF_DLC_2_Pos            (2)
    #define CAN_FF_DLC_2                (0x01U << CAN_FF_DLC_2_Pos)             ///< CAN data length code bit
    #define CAN_FF_DLC_3_Pos            (3)
      #define CAN_FF_DLC_3              (0x01U << CAN_FF_DLC_3_Pos)             ///< CAN data length code bit
    #define CAN_FF_RTR_Pos              (6)
    #define CAN_FF_RTR                  (0x01U << CAN_FF_RTR_Pos)               ///< CAN remote transmission request
    #define CAN_FF_FF_Pos               (7)
    #define CAN_FF_FF                   (0x01U << CAN_FF_FF_Pos)                ///< CAN frame format
////////////////////////////////////////////////////////////////////////////////
/// @brief CAN_TXID0 register Bit definition
////////////////////////////////////////////////////////////////////////////////
    #define CAN_TXID0_ID_21_Pos         (0)
    #define CAN_TXID0_ID_21             (0x01U << CAN_TXID0_ID_21_Pos)          ///< CAN identifier bit 21
    #define CAN_TXID0_ID_22_Pos         (1)
    #define CAN_TXID0_ID_22             (0x01U << CAN_TXID0_ID_22_Pos)          ///< CAN identifier bit 22
    #define CAN_TXID0_ID_23_Pos         (2)
    #define CAN_TXID0_ID_23             (0x01U << CAN_TXID0_ID_23_Pos)          ///< CAN identifier bit 23
    #define CAN_TXID0_ID_24_Pos         (3)
    #define CAN_TXID0_ID_24             (0x01U << CAN_TXID0_ID_24_Pos)          ///< CAN identifier bit 24
    #define CAN_TXID0_ID_25_Pos         (4)
    #define CAN_TXID0_ID_25             (0x01U << CAN_TXID0_ID_25_Pos)          ///< CAN identifier bit 25
    #define CAN_TXID0_ID_26_Pos         (5)
    #define CAN_TXID0_ID_26             (0x01U << CAN_TXID0_ID_26_Pos)          ///< CAN identifier bit 26
    #define CAN_TXID0_ID_27_Pos         (6)
    #define CAN_TXID0_ID_27             (0x01U << CAN_TXID0_ID_27_Pos)          ///< CAN identifier bit 27
    #define CAN_TXID0_ID_28_Pos         (7)
    #define CAN_TXID0_ID_28             (0x01U << CAN_TXID0_ID_28_Pos)          ///< CAN identifier bit 28

////////////////////////////////////////////////////////////////////////////////
/// @brief CAN_TXID1 register Bit definition
////////////////////////////////////////////////////////////////////////////////
    #define CAN_TXID1_ID_13_Pos         (0)
    #define CAN_TXID1_ID_13             (0x01U << CAN_TXID1_ID_13_Pos)          ///< CAN identifier bit 13
    #define CAN_TXID1_ID_14_Pos         (1)
    #define CAN_TXID1_ID_14             (0x01U << CAN_TXID1_ID_14_Pos)          ///< CAN identifier bit 14
    #define CAN_TXID1_ID_15_Pos         (2)
    #define CAN_TXID1_ID_15             (0x01U << CAN_TXID1_ID_15_Pos)          ///< CAN identifier bit 15
    #define CAN_TXID1_ID_16_Pos         (3)
    #define CAN_TXID1_ID_16             (0x01U << CAN_TXID1_ID_16_Pos)          ///< CAN identifier bit 16
    #define CAN_TXID1_ID_17_Pos         (4)
    #define CAN_TXID1_ID_17             (0x01U << CAN_TXID1_ID_17_Pos)          ///< CAN identifier bit 17
    #define CAN_TXID1_ID_18_Pos         (5)
    #define CAN_TXID1_ID_18             (0x01U << CAN_TXID1_ID_18_Pos)          ///< CAN identifier bit 18
    #define CAN_TXID1_ID_19_Pos         (6)
    #define CAN_TXID1_ID_19             (0x01U << CAN_TXID1_ID_19_Pos)          ///< CAN identifier bit 19
    #define CAN_TXID1_ID_20_Pos         (7)
    #define CAN_TXID1_ID_20             (0x01U << CAN_TXID1_ID_20_Pos)          ///< CAN identifier bit 20

////////////////////////////////////////////////////////////////////////////////
/// @brief CAN_TXDATAn register Bit definition
////////////////////////////////////////////////////////////////////////////////
    #define CAN_TXDATAn_Pos             (0)
    #define CAN_TXDATAn                 (0x00FFU << CAN_TXDATAn_Pos)            ///< CAN transmit data n

////////////////////////////////////////////////////////////////////////////////
/// @brief CAN_CDR register Bit definition
////////////////////////////////////////////////////////////////////////////////
    #define CAN_CDR_MODE_Pos            (7)
    #define CAN_CDR_MODE                (0x01U << CAN_CDR_MODE_Pos)             ///< CAN mode
#endif

#if defined(__MM3N1) || defined(__MM0N1)
////////////////////////////////////////////////////////////////////////////////
/// @brief COMP_CSR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define COMP_CSR_EN_Pos                 (0)
#define COMP_CSR_EN                     (0x01U << COMP_CSR_EN_Pos)              ///< Comparator enable
#define COMP_CSR_MODE_Pos               (2)
#define COMP_CSR_MODE                   (0x03U << COMP_CSR_MODE_Pos)            ///< Comparator mode
#define COMP_CSR_MODE_LOWESTPOWER       (0x00U << COMP_CSR_MODE_Pos)            ///< Comparator lowest power mode
#define COMP_CSR_MODE_LOWPOWER          (0x01U << COMP_CSR_MODE_Pos)            ///< Comparator low power mode
#define COMP_CSR_MODE_MEDIUMRATE        (0x02U << COMP_CSR_MODE_Pos)            ///< Comparator medium rate mode
#define COMP_CSR_MODE_HIGHRATE          (0x03U << COMP_CSR_MODE_Pos)            ///< Comparator high rate mode
#define COMP_CSR_INM_Pos                (4)
#define COMP_CSR_INM                    (0x07U << COMP_CSR_INM_Pos)             ///< Comparator inverting input selection
#define COMP_CSR_INM_VREFINT_1_4        (0x00U << COMP_CSR_INM_Pos)             ///< Vrefint 1/4 as COMP inverting input
#define COMP_CSR_INM_VREFINT_1_2        (0x01U << COMP_CSR_INM_Pos)             ///< Vrefint 1/2 as COMP inverting input
#define COMP_CSR_INM_VREFINT_3_4        (0x02U << COMP_CSR_INM_Pos)             ///< Vrefint 3/4 as COMP inverting input
#define COMP_CSR_INM_VREFINT            (0x03U << COMP_CSR_INM_Pos)             ///< Vrefint 1 as COMP inverting input
#define COMP_CSR_INM_INM4               (0x04U << COMP_CSR_INM_Pos)             ///< INM4 as COMP inverting input
#define COMP_CSR_INM_INM5               (0x05U << COMP_CSR_INM_Pos)             ///< INM5 as COMP inverting input
#define COMP_CSR_INM_INM6               (0x06U << COMP_CSR_INM_Pos)             ///< INM6 as COMP inverting input
#define COMP_CSR_INM_INM7               (0x07U << COMP_CSR_INM_Pos)             ///< INM7 as COMP inverting input
#define COMP_CSR_INP_Pos                (7)
#define COMP_CSR_INP                    (0x07U << COMP_CSR_INP_Pos)             ///< Comparator non-inverting input selection
#define COMP_CSR_INP_INP0               (0x00U << COMP_CSR_INP_Pos)             ///< INP0 as COMP non-inverting input
#define COMP_CSR_INP_INP1               (0x01U << COMP_CSR_INP_Pos)             ///< INP1 as COMP non-inverting input
#define COMP_CSR_INP_INP2               (0x02U << COMP_CSR_INP_Pos)             ///< INP2 as COMP non-inverting input
#define COMP_CSR_INP_INP3               (0x03U << COMP_CSR_INP_Pos)             ///< INP3 as COMP non-inverting input
#define COMP_CSR_INP_INP4               (0x04U << COMP_CSR_INP_Pos)             ///< INP4 as COMP non-inverting input
#define COMP_CSR_INP_INP5               (0x05U << COMP_CSR_INP_Pos)             ///< INP5 as COMP non-inverting input
#define COMP_CSR_INP_INP6               (0x06U << COMP_CSR_INP_Pos)             ///< INP6 as COMP non-inverting input
#define COMP_CSR_INP_INP7               (0x07U << COMP_CSR_INP_Pos)             ///< INP7 as COMP non-inverting input
#define COMP_CSR_OUT_Pos                (10)
#define COMP_CSR_OUT                    (0x0FU << COMP_CSR_OUT_Pos)             ///< Comparator output selection
#define COMP_CSR_OUT_TIM1_BRAKE         (0x02U << COMP_CSR_OUT_Pos)             ///< Timer1 brake input
#define COMP_CSR_OUT_TIM1_OCREFCLR      (0x06U << COMP_CSR_OUT_Pos)             ///< Timer1 ocrefclear input
#define COMP_CSR_OUT_TIM1_CAPTURE1      (0x07U << COMP_CSR_OUT_Pos)             ///< Timer1 input capture 1
#define COMP_CSR_OUT_TIM2_CAPTURE4      (0x08U << COMP_CSR_OUT_Pos)             ///< Timer2 input capture 4
#define COMP_CSR_OUT_TIM2_OCREFCLR      (0x09U << COMP_CSR_OUT_Pos)             ///< Timer2 ocrefclear input
#define COMP_CSR_OUT_TIM3_CAPTURE1      (0x0AU << COMP_CSR_OUT_Pos)             ///< Timer3 input capture 1
#define COMP_CSR_OUT_TIM3_OCREFCLR      (0x0BU << COMP_CSR_OUT_Pos)             ///< Timer3 ocrefclear input
#define COMP_CSR_POL_Pos                (15)
#define COMP_CSR_POL                    (0x01U << COMP_CSR_POL_Pos)             ///< Comparator output polarity
#define COMP_CSR_HYST_Pos               (16)
#define COMP_CSR_HYST                   (0x03U << COMP_CSR_HYST_Pos)            ///< Comparator hysteresis
#define COMP_CSR_HYST_0                 (0x00U << COMP_CSR_HYST_Pos)            ///< Hysteresis Voltage: 0mV
#define COMP_CSR_HYST_9                 (0x01U << COMP_CSR_HYST_Pos)            ///< Hysteresis Voltage: 9mV
#define COMP_CSR_HYST_18                (0x02U << COMP_CSR_HYST_Pos)            ///< Hysteresis Voltage: 18mV
#define COMP_CSR_HYST_27                (0x03U << COMP_CSR_HYST_Pos)            ///< Hysteresis Voltage: 27mV
#define COMP_CSR_OUT_STA_Pos            (30)
#define COMP_CSR_OUT_STA                (0x01U << COMP_CSR_OUT_STA_Pos)         ///< Comparator output status
#define COMP_CSR_LOCK_Pos               (31)
#define COMP_CSR_LOCK                   (0x01U << COMP_CSR_LOCK_Pos)            ///< Comparator lock

#endif


