mm32/MM32_FDS/library/startup/inc/_mm32.h
#if defined(__MM0P1) || defined(__MM0Q1)
////////////////////////////////////////////////////////////////////////////////
/// @brief COMP_CSR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
    #define COMP_CSR_EN_Pos             (0)
    #define COMP_CSR_EN                 (0x01U << COMP_CSR_EN_Pos)              ///< Comparator enable
    #define COMP_CSR_MODE_Pos           (2)
    #define COMP_CSR_MODE               (0x03U << COMP_CSR_MODE_Pos)            ///< Comparator mode
    #define COMP_CSR_MODE_LOWESTPOWER   (0x00U << COMP_CSR_MODE_Pos)            ///< Comparator lowest power mode
    #define COMP_CSR_MODE_LOWPOWER      (0x01U << COMP_CSR_MODE_Pos)            ///< Comparator low power mode
    #define COMP_CSR_MODE_MEDIUMRATE    (0x02U << COMP_CSR_MODE_Pos)            ///< Comparator medium rate mode
    #define COMP_CSR_MODE_HIGHRATE      (0x03U << COMP_CSR_MODE_Pos)            ///< Comparator high rate mode

    #define COMP_CSR_INM_Pos            (4)
    #define COMP_CSR_INM                (0x03U << COMP_CSR_INM_Pos)             ///< Comparator inverting input selection
    #define COMP_CSR_INM_0              (0x00U << COMP_CSR_INM_Pos)             ///< INM0 as COMP inverting input
    #define COMP_CSR_INM_1              (0x01U << COMP_CSR_INM_Pos)             ///< INM1 as COMP inverting input
    #define COMP_CSR_INM_2              (0x02U << COMP_CSR_INM_Pos)             ///< INM2 as COMP inverting input
    #define COMP_CSR_INM_3              (0x03U << COMP_CSR_INM_Pos)             ///< INM3 as COMP inverting input

    #define COMP_CSR_INP_Pos            (7)
    #define COMP_CSR_INP                (0x04U << COMP_CSR_INP_Pos)             ///< Comparator non-inverting input selection
    #define COMP_CSR_INP_INP0           (0x00U << COMP_CSR_INP_Pos)             ///< INP0 as COMP non-inverting input
    #define COMP_CSR_INP_INP1           (0x01U << COMP_CSR_INP_Pos)             ///< INP1 as COMP non-inverting input
    #define COMP_CSR_INP_INP2           (0x02U << COMP_CSR_INP_Pos)             ///< INP2 as COMP non-inverting input
    #define COMP_CSR_INP_INP3           (0x03U << COMP_CSR_INP_Pos)             ///< INP3 as COMP non-inverting input

    #define COMP_CSR_OUT_Pos            (10)
    #define COMP_CSR_OUT                (0x0FU << COMP_CSR_OUT_Pos)             ///< Comparator output selection
    #define COMP_CSR_OUT_TIM1_BRAKE     (0x02U << COMP_CSR_OUT_Pos)             ///< Timer1 brake input
    #define COMP_CSR_OUT_TIM8_BRAKE     (0x03U << COMP_CSR_OUT_Pos)             ///< Timer8 brake input
    #define COMP_CSR_OUT_TIM1_OCREFCLR  (0x06U << COMP_CSR_OUT_Pos)             ///< Timer1 ocrefclear input
    #define COMP_CSR_OUT_TIM1_CAPTURE1  (0x07U << COMP_CSR_OUT_Pos)             ///< Timer1 input capture 1
    #define COMP_CSR_OUT_TIM2_CAPTURE4  (0x08U << COMP_CSR_OUT_Pos)             ///< Timer2 input capture 4
    #define COMP_CSR_OUT_TIM2_OCREFCLR  (0x09U << COMP_CSR_OUT_Pos)             ///< Timer2 ocrefclear input
    #define COMP_CSR_OUT_TIM3_CAPTURE1  (0x0AU << COMP_CSR_OUT_Pos)             ///< Timer3 input capture 1
    #define COMP_CSR_OUT_TIM3_OCREFCLR  (0x0BU << COMP_CSR_OUT_Pos)             ///< Timer3 ocrefclear input
    #define COMP_CSR_OUT_TIM8_OCREFCLR  (0x0FU << COMP_CSR_OUT_Pos)             ///< Timer8 ocrefclear input

    #define COMP_CSR_POL_Pos            (15)
    #define COMP_CSR_POL                (0x01U << COMP_CSR_POL_Pos)             ///< Comparator output polarity
    #define COMP_CSR_HYST_Pos           (16)
    #define COMP_CSR_HYST               (0x03U << COMP_CSR_HYST_Pos)            ///< Comparator hysteresis
    #define COMP_CSR_HYST_0             (0x00U << COMP_CSR_HYST_Pos)            ///< Hysteresis Voltage: 0mV
    #define COMP_CSR_HYST_15            (0x01U << COMP_CSR_HYST_Pos)            ///< Hysteresis Voltage: 15mV
    #define COMP_CSR_HYST_30            (0x02U << COMP_CSR_HYST_Pos)            ///< Hysteresis Voltage: 30mV
    #define COMP_CSR_HYST_90            (0x03U << COMP_CSR_HYST_Pos)            ///< Hysteresis Voltage: 90mV

    #define COMP_CSR_OFLT_Pos           (18)
    #define COMP_CSR_OFLT               (0x07U << COMP_CSR_OFLT_Pos)            ///< Comparator output filter
    #define COMP_CSR_OFLT_0             (0x00U << COMP_CSR_OFLT_Pos)            ///< 1 clock cycle
    #define COMP_CSR_OFLT_1             (0x01U << COMP_CSR_OFLT_Pos)            ///< 4 clock cycle
    #define COMP_CSR_OFLT_2             (0x02U << COMP_CSR_OFLT_Pos)            ///< 16 clock cycle
    #define COMP_CSR_OFLT_3             (0x03U << COMP_CSR_OFLT_Pos)            ///< 32 clock cycle
    #define COMP_CSR_OFLT_4             (0x04U << COMP_CSR_OFLT_Pos)            ///< 64 clock cycle
    #define COMP_CSR_OFLT_5             (0x05U << COMP_CSR_OFLT_Pos)            ///< 128 clock cycle
    #define COMP_CSR_OFLT_6             (0x06U << COMP_CSR_OFLT_Pos)            ///< 256 clock cycle
    #define COMP_CSR_OFLT_7             (0x07U << COMP_CSR_OFLT_Pos)            ///< 512 clock cycle

    #define COMP_CSR_OUT_STA_Pos        (30)
    #define COMP_CSR_OUT_STA            (0x01U << COMP_CSR_OUT_STA_Pos)         ///< Comparator output status
    #define COMP_CSR_LOCK_Pos           (31)
    #define COMP_CSR_LOCK               (0x01U << COMP_CSR_LOCK_Pos)            ///< Comparator lock
#endif

////////////////////////////////////////////////////////////////////////////////
/// @brief COMP_CRV Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
    #define COMP_CRV_SEL_Pos            (0)
    #define COMP_CRV_SEL                (0x0FU << COMP_CRV_SEL_Pos)             ///< Comparator external reference voltage select

    #define COMP_CRV_SEL_1_20           (0x00U << COMP_CRV_SEL_Pos)             ///< Comparator external reference voltage select
    #define COMP_CRV_SEL_2_20           (0x01U << COMP_CRV_SEL_Pos)             ///< Comparator external reference voltage select
    #define COMP_CRV_SEL_3_20           (0x02U << COMP_CRV_SEL_Pos)             ///< Comparator external reference voltage select
    #define COMP_CRV_SEL_4_20           (0x03U << COMP_CRV_SEL_Pos)             ///< Comparator external reference voltage select
    #define COMP_CRV_SEL_5_20           (0x04U << COMP_CRV_SEL_Pos)             ///< Comparator external reference voltage select
    #define COMP_CRV_SEL_6_20           (0x05U << COMP_CRV_SEL_Pos)             ///< Comparator external reference voltage select
    #define COMP_CRV_SEL_7_20           (0x06U << COMP_CRV_SEL_Pos)             ///< Comparator external reference voltage select
    #define COMP_CRV_SEL_8_20           (0x07U << COMP_CRV_SEL_Pos)             ///< Comparator external reference voltage select
    #define COMP_CRV_SEL_9_20           (0x08U << COMP_CRV_SEL_Pos)             ///< Comparator external reference voltage select
    #define COMP_CRV_SEL_10_20          (0x09U << COMP_CRV_SEL_Pos)             ///< Comparator external reference voltage select
    #define COMP_CRV_SEL_11_20          (0x0AU << COMP_CRV_SEL_Pos)             ///< Comparator external reference voltage select
    #define COMP_CRV_SEL_12_20          (0x0BU << COMP_CRV_SEL_Pos)             ///< Comparator external reference voltage select
    #define COMP_CRV_SEL_13_20          (0x0CU << COMP_CRV_SEL_Pos)             ///< Comparator external reference voltage select
    #define COMP_CRV_SEL_14_20          (0x0DU << COMP_CRV_SEL_Pos)             ///< Comparator external reference voltage select
    #define COMP_CRV_SEL_15_20          (0x0EU << COMP_CRV_SEL_Pos)             ///< Comparator external reference voltage select
    #define COMP_CRV_SEL_16_20          (0x0FU << COMP_CRV_SEL_Pos)             ///< Comparator external reference voltage select

    #define COMP_CRV_EN_Pos             (4)
    #define COMP_CRV_EN                 (0x01U << COMP_CRV_EN_Pos)              ///< Comparator external reference voltage enable
    #define COMP_CRV_EN_DISABLE         (0x00U << COMP_CRV_EN_Pos)              ///< Disable comparator external reference voltage
    #define COMP_CRV_EN_ENABLE          (0x01U << COMP_CRV_EN_Pos)              ///< Enable comparator external reference voltage
    #define COMP_CRV_SRC_Pos            (5)
    #define COMP_CRV_SRC                (0x01U << COMP_CRV_SRC_Pos)             ///< Comparator external reference voltage source select
    #define COMP_CRV_SRC_AVDD           (0x00U << COMP_CRV_SRC_Pos)             ///< Select AVDD
    #define COMP_CRV_SRC_VREF           (0x01U << COMP_CRV_SRC_Pos)             ///< Select VREF

