mm32/MM32_FDS/library/startup/inc/_mm32.h
#if defined(__MM0P1) || defined(__MM0Q1)
////////////////////////////////////////////////////////////////////////////////
/// @brief COMP_POL Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
    #define COMP_POL_EN_Pos             (0)
    #define COMP_POL_EN                 (0x01U << COMP_POL_EN_Pos)              ///< Comparator polling enable
    #define COMP_POL_EN_DISABLE         (0x00U << COMP_POL_EN_Pos)              ///< Disable comparator polling mode
    #define COMP_POL_EN_ENABLE          (0x01U << COMP_POL_EN_Pos)              ///< Enable comparator polling mode
    #define COMP_POL_CH_Pos             (1)
    #define COMP_POL_CH                 (0x01U << COMP_POL_CH_Pos)              ///< Comparator polling channel
    #define COMP_POL_CH_1_2             (0x00U << COMP_POL_CH_Pos)              ///< Polling channel 1/2
    #define COMP_POL_CH_1_2_3           (0x01U << COMP_POL_CH_Pos)              ///< Polling channel 1/2/3
    #define COMP_POL_FIXN_Pos           (2)
    #define COMP_POL_FIXN               (0x01U << COMP_POL_FIXN_Pos)            ///< Polling inverting input fix
    #define COMP_POL_FIXN_NOTFIXED      (0x00U << COMP_POL_FIXN_Pos)            ///< Polling channel inverting input is not fixed
    #define COMP_POL_FIXN_FIXED         (0x01U << COMP_POL_FIXN_Pos)            ///< Polling channel inverting input fixed
    #define COMP_POL_PERIOD_Pos         (4)
    #define COMP_POLL_PERIOD            (0x07U << COMP_POL_PERIOD_Pos)          ///< polling wait cycle
    #define COMP_POLL_PERIOD_1          (0x00U << COMP_POL_PERIOD_Pos)          ///< 1 clock cycle
    #define COMP_POLL_PERIOD_2          (0x01U << COMP_POL_PERIOD_Pos)          ///< 2 clock cycle
    #define COMP_POLL_PERIOD_4          (0x02U << COMP_POL_PERIOD_Pos)          ///< 4 clock cycle
    #define COMP_POLL_PERIOD_8          (0x03U << COMP_POL_PERIOD_Pos)          ///< 8 clock cycle
    #define COMP_POLL_PERIOD_16         (0x04U << COMP_POL_PERIOD_Pos)          ///< 16 clock cycle
    #define COMP_POLL_PERIOD_32         (0x05U << COMP_POL_PERIOD_Pos)          ///< 32 clock cycle
    #define COMP_POLL_PERIOD_64         (0x06U << COMP_POL_PERIOD_Pos)          ///< 64 clock cycle
    #define COMP_POLL_PERIOD_128        (0x07U << COMP_POL_PERIOD_Pos)          ///< 128 clock cycle
    #define COMP_POL_POUT_Pos           (8)
    #define COMP_POL_POUT               (0x07U << COMP_POL_POUT_Pos)            ///< Polling output
    #define COMP_POL_POUT_Low           (0x00U << COMP_POL_POUT_Pos)            ///< Non-inverting input is lower than inverting input
    #define COMP_POL_POUT_High          (0x01U << COMP_POL_POUT_Pos)            ///< Non-inverting input is higher than inverting input
#endif

////////////////////////////////////////////////////////////////////////////////
/// @brief CRC_DR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define CRC_DR_DR_Pos                   (0)
#define CRC_DR_DR                       (0xFFFFFFFFU << CRC_DR_DR_Pos)          ///< Data register bits
////////////////////////////////////////////////////////////////////////////////
/// @brief CRC_IDR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define CRC_IDR_IDR_Pos                 (0)
#define CRC_IDR_IDR                     (0xFFU << CRC_IDR_IDR_Pos)              ///< General-purpose 8-bit data register bits

////////////////////////////////////////////////////////////////////////////////
/// @brief CRC_CTRL Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define CRC_CR_RESET_Pos                (0)
#define CRC_CR_RESET                    (0x01U << CRC_CR_RESET_Pos)             ///< RESET bit

#if defined(__MM0N1)
////////////////////////////////////////////////////////////////////////////////
/// @brief CRS_CR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
    #define CRS_CR_OKIE_Pos             (0)
    #define CRS_CR_OKIE                 (0x01U << CRS_CR_OKIE_Pos)              ///< SYNC event OK interrupt enable
    #define CRS_CR_WARNIE_Pos           (1)
    #define CRS_CR_WARNIE               (0x01U << CRS_CR_WARNIE_Pos)            ///< SYNC warning interrupt enable
    #define CRS_CR_ERRIE_Pos            (2)
    #define CRS_CR_ERRIE                (0x01U << CRS_CR_ERRIE_Pos)             ///< Synchronization or trimming error interrupt enable
    #define CRS_CR_EXPTIE_Pos           (3)
    #define CRS_CR_EXPTIE               (0x01U << CRS_CR_EXPTIE_Pos)            ///< Expected SYNC interrupt enable
    #define CRS_CR_CNTEN_Pos            (5)
    #define CRS_CR_CNTEN                (0x01U << CRS_CR_CNTEN_Pos)             ///< Frequency error counter enable
    #define CRS_CR_AUTOTRIMEN_Pos       (6)
    #define CRS_CR_AUTOTRIMEN           (0x01U << CRS_CR_AUTOTRIMEN_Pos)        ///< Automatic trimming enable
    #define CRS_CR_SWSYNC_Pos           (7)
    #define CRS_CR_SWSYNC               (0x01U << CRS_CR_SWSYNC_Pos)            ///< Generate software SYNC event
    #define CRS_CR_TRIM_Pos             (8)
    #define CRS_CR_TRIM                 (0x3FU << CRS_CR_TRIM_Pos)              ///< HSI 48 oscillator smooth trimming

////////////////////////////////////////////////////////////////////////////////
/// @brief CRS_CFGR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
    #define CRS_CFGR_RELOAD_Pos         (0)
    #define CRS_CFGR_RELOAD             (0xFFFFU << CRS_CFGR_RELOAD_Pos)        ///< Counter reload value
    #define CRS_CFGR_FELIM_Pos          (16)
    #define CRS_CFGR_FELIM              (0xFFU << CRS_CFGR_FELIM_Pos)           ///< Frequency error limit
    #define CRS_CFGR_DIV_Pos            (24)
    #define CRS_CFGR_DIV                (0x07U << CRS_CFGR_DIV_Pos)             ///< SYNC divider
    #define CRS_CFGR_SRC_Pos            (28)
    #define CRS_CFGR_SRC                (0x03U << CRS_CFGR_SRC_Pos)             ///< SYNC signal source selection
    #define CRS_CFGR_SRC_MCO            (0x00U << CRS_CFGR_SRC_Pos)
    #define CRS_CFGR_SRC_USBSOF         (0x02U << CRS_CFGR_SRC_Pos)
    #define CRS_CFGR_POL_Pos            (31)
    #define CRS_CFGR_POL                (0x01U << CRS_CFGR_POL_Pos)             ///< SYNC polarity selection

////////////////////////////////////////////////////////////////////////////////
/// @brief CRS_ISR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
    #define CRS_ISR_OKIF_Pos            (0)
    #define CRS_ISR_OKIF                (0x01U << CRS_ISR_OKIF_Pos)             ///< SYNC event OK flag
    #define CRS_ISR_WARNIF_Pos          (1)
    #define CRS_ISR_WARNIF              (0x01U << CRS_ISR_WARNIF_Pos)           ///< SYNC warning flag
    #define CRS_ISR_ERRIF_Pos           (2)
    #define CRS_ISR_ERRIF               (0x01U << CRS_ISR_ERRIF_Pos)            ///< Error flag
    #define CRS_ISR_EXPTIF_Pos          (3)
    #define CRS_ISR_EXPTIF              (0x01U << CRS_ISR_EXPTIF_Pos)           ///< Expected SYNC flag
    #define CRS_ISR_ERR_Pos             (8)
    #define CRS_ISR_ERR                 (0x01U << CRS_ISR_ERR_Pos)              ///< SYNC error
    #define CRS_ISR_MISS_Pos            (9)
    #define CRS_ISR_MISS                (0x01U << CRS_ISR_MISS_Pos)             ///< SYNC missed
    #define CRS_ISR_OVERFLOW_Pos        (10)
    #define CRS_ISR_OVERFLOW            (0x01U << CRS_ISR_OVERFLOW_Pos)         ///< Trimming overflow or underflow
    #define CRS_ISR_FEDIR_Pos           (15)
    #define CRS_ISR_FEDIR               (0x01U << CRS_ISR_FEDIR_Pos)            ///< Frequency error direction
    #define CRS_ISR_FECAP_Pos           (16)
    #define CRS_ISR_FECAP               (0xFFFFU << CRS_ISR_FECAP_Pos)          ///< Frequency error capture

////////////////////////////////////////////////////////////////////////////////
/// @brief CRS_ICR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
    #define CRS_ICR_OK_Pos              (0)
    #define CRS_ICR_OK                  (0x01U << CRS_ICR_OK_Pos)               ///< SYNC event OK clear flag
    #define CRS_ICR_WARN_Pos            (1)
    #define CRS_ICR_WARN                (0x01U << CRS_ICR_WARN_Pos)             ///< SYNC warning clear flag
    #define CRS_ICR_ERR_Pos             (2)
    #define CRS_ICR_ERR                 (0x01U << CRS_ICR_ERR_Pos)              ///< Error clear flag
    #define CRS_ICR_EXPT_Pos            (3)
    #define CRS_ICR_EXPT                (0x01U << CRS_ICR_EXPT_Pos)             ///< Expected SYNC clear flag
#endif

#if defined(__MM3N1)
////////////////////////////////////////////////////////////////////////////////
/// @brief DAC_CR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
    #define DAC_CR_EN1_Pos              (0)
    #define DAC_CR_EN1                  (0x01U << DAC_CR_EN1_Pos)               ///< DAC channel1 enable
    #define DAC_CR_BOFF1_Pos            (1)
    #define DAC_CR_BOFF1                (0x01U << DAC_CR_BOFF1_Pos)             ///< DAC channel1 output buffer disable
    #define DAC_CR_TEN1_Pos             (2)
    #define DAC_CR_TEN1                 (0x01U << DAC_CR_TEN1_Pos)              ///< DAC channel1 Trigger enable
    #define DAC_CR_TSEL1_Pos            (3)
    #define DAC_CR_TSEL1                (0x07U << DAC_CR_TSEL1_Pos)             ///< TSEL1[2:0] (DAC channel1 Trigger selection)
    #define DAC_CR_TSEL1_TIM1_TRIG      (0x00U << DAC_CR_TSEL1_Pos)             ///< TIM1_TRIG trigger
    #define DAC_CR_TSEL1_TIM3_TRIG      (0x01U << DAC_CR_TSEL1_Pos)             ///< TIM3_TRIG trigger
    #define DAC_CR_TSEL1_TIM2_TRIG      (0x04U << DAC_CR_TSEL1_Pos)             ///< TIM2_TRIG trigger
    #define DAC_CR_TSEL1_TIM4_TRIG      (0x05U << DAC_CR_TSEL1_Pos)             ///< TIM4_TRIG trigger
    #define DAC_CR_TSEL1_EXTI9          (0x06U << DAC_CR_TSEL1_Pos)             ///< External interrupt line 9 trigger
    #define DAC_CR_TSEL1_SOFTWARE       (0x07U << DAC_CR_TSEL1_Pos)             ///< Software trigger
    #define DAC_CR_WAVE1_Pos            (6)
    #define DAC_CR_WAVE1                (0x03U << DAC_CR_WAVE1_Pos)             ///< WAVE1[1:0] (DAC channel1 noise/triangle wave generation enable)
    #define DAC_CR_WAVE1_NONE           (0x00U << DAC_CR_WAVE1_Pos)             ///< Turn off waveform generation
    #define DAC_CR_WAVE1_NOISE          (0x01U << DAC_CR_WAVE1_Pos)             ///< Noise waveform generation
    #define DAC_CR_WAVE1_TRIANGLE       (0x02U << DAC_CR_WAVE1_Pos)             ///< Triangle wave generation
    #define DAC_CR_MAMP1_Pos            (8)
    #define DAC_CR_MAMP1                (0x0FU << DAC_CR_MAMP1_Pos)             ///< MAMP1[3:0] (DAC channel1 Mask/Amplitude selector)
    #define DAC_CR_MAMP1_1              (0x00U << DAC_CR_MAMP1_Pos)             ///< Triangle wave amplitude equal to 1
    #define DAC_CR_MAMP1_3              (0x01U << DAC_CR_MAMP1_Pos)             ///< Triangle wave amplitude equal to 3
    #define DAC_CR_MAMP1_7              (0x02U << DAC_CR_MAMP1_Pos)             ///< Triangle wave amplitude equal to 7
    #define DAC_CR_MAMP1_15             (0x03U << DAC_CR_MAMP1_Pos)             ///< Triangle wave amplitude equal to 15
    #define DAC_CR_MAMP1_31             (0x04U << DAC_CR_MAMP1_Pos)             ///< Triangle wave amplitude equal to 31
    #define DAC_CR_MAMP1_63             (0x05U << DAC_CR_MAMP1_Pos)             ///< Triangle wave amplitude equal to 63
    #define DAC_CR_MAMP1_127            (0x06U << DAC_CR_MAMP1_Pos)             ///< Triangle wave amplitude equal to 127
    #define DAC_CR_MAMP1_255            (0x07U << DAC_CR_MAMP1_Pos)             ///< Triangle wave amplitude equal to 255
    #define DAC_CR_MAMP1_511            (0x08U << DAC_CR_MAMP1_Pos)             ///< Triangle wave amplitude equal to 511
    #define DAC_CR_MAMP1_1023           (0x09U << DAC_CR_MAMP1_Pos)             ///< Triangle wave amplitude equal to 1023
    #define DAC_CR_MAMP1_2047           (0x0AU << DAC_CR_MAMP1_Pos)             ///< Triangle wave amplitude equal to 2047
    #define DAC_CR_MAMP1_4095           (0x0BU << DAC_CR_MAMP1_Pos)             ///< Triangle wave amplitude equal to 4095
    #define DAC_CR_DMAEN1_Pos           (12)
    #define DAC_CR_DMAEN1               (0x01U << DAC_CR_DMAEN1_Pos)            ///< DAC channel1 DMA enable
    #define DAC_CR_EN2_Pos              (16)
    #define DAC_CR_EN2                  (0x01U << DAC_CR_EN2_Pos)               ///< DAC channel2 enable
    #define DAC_CR_BOFF2_Pos            (17)
    #define DAC_CR_BOFF2                (0x01U << DAC_CR_BOFF2_Pos)             ///< DAC channel2 output buffer disable
    #define DAC_CR_TEN2_Pos             (18)
    #define DAC_CR_TEN2                 (0x01U << DAC_CR_TEN2_Pos)              ///< DAC channel2 Trigger enable
    #define DAC_CR_TSEL2_Pos            (19)
    #define DAC_CR_TSEL2                (0x07U << DAC_CR_TSEL2_Pos)             ///< TSEL1[2:0] (DAC channel1 Trigger selection)
    #define DAC_CR_TSEL2_TIM1_TRIG      (0x00U << DAC_CR_TSEL2_Pos)             ///< TIM1_TRIG trigger
    #define DAC_CR_TSEL2_TIM3_TRIG      (0x01U << DAC_CR_TSEL2_Pos)             ///< TIM3_TRIG trigger
    #define DAC_CR_TSEL2_TIM2_TRIG      (0x04U << DAC_CR_TSEL2_Pos)             ///< TIM2_TRIG trigger
    #define DAC_CR_TSEL2_TIM4_TRIG      (0x05U << DAC_CR_TSEL2_Pos)             ///< TIM4_TRIG trigger
    #define DAC_CR_TSEL2_EXTI9          (0x06U << DAC_CR_TSEL2_Pos)             ///< External interrupt line 9 trigger
    #define DAC_CR_TSEL2_SOFTWARE       (0x07U << DAC_CR_TSEL2_Pos)             ///< Software trigger
    #define DAC_CR_WAVE2_Pos            (22)
    #define DAC_CR_WAVE2                (0x03U << DAC_CR_WAVE2_Pos)             ///< WAVE1[1:0] (DAC channel1 noise/triangle wave generation enable)
    #define DAC_CR_WAVE2_NONE           (0x00U << DAC_CR_WAVE2_Pos)             ///< Turn off waveform generation
    #define DAC_CR_WAVE2_NOISE          (0x01U << DAC_CR_WAVE2_Pos)             ///< Noise waveform generation
    #define DAC_CR_WAVE2_TRIANGLE       (0x02U << DAC_CR_WAVE2_Pos)             ///< Triangle wave generation
    #define DAC_CR_MAMP2_Pos            (24)
    #define DAC_CR_MAMP2                (0x0FU << DAC_CR_MAMP2_Pos)             ///< MAMP1[3:0] (DAC channel1 Mask/Amplitude selector)
    #define DAC_CR_MAMP2_1              (0x00U << DAC_CR_MAMP2_Pos)             ///< Triangle wave amplitude equal to 1
    #define DAC_CR_MAMP2_3              (0x01U << DAC_CR_MAMP2_Pos)             ///< Triangle wave amplitude equal to 3
    #define DAC_CR_MAMP2_7              (0x02U << DAC_CR_MAMP2_Pos)             ///< Triangle wave amplitude equal to 7
    #define DAC_CR_MAMP2_15             (0x03U << DAC_CR_MAMP2_Pos)             ///< Triangle wave amplitude equal to 15
    #define DAC_CR_MAMP2_31             (0x04U << DAC_CR_MAMP2_Pos)             ///< Triangle wave amplitude equal to 31
    #define DAC_CR_MAMP2_63             (0x05U << DAC_CR_MAMP2_Pos)             ///< Triangle wave amplitude equal to 63
    #define DAC_CR_MAMP2_127            (0x06U << DAC_CR_MAMP2_Pos)             ///< Triangle wave amplitude equal to 127
    #define DAC_CR_MAMP2_255            (0x07U << DAC_CR_MAMP2_Pos)             ///< Triangle wave amplitude equal to 255
    #define DAC_CR_MAMP2_511            (0x08U << DAC_CR_MAMP2_Pos)             ///< Triangle wave amplitude equal to 511
    #define DAC_CR_MAMP2_1023           (0x09U << DAC_CR_MAMP2_Pos)             ///< Triangle wave amplitude equal to 1023
    #define DAC_CR_MAMP2_2047           (0x0AU << DAC_CR_MAMP2_Pos)             ///< Triangle wave amplitude equal to 2047
    #define DAC_CR_MAMP2_4095           (0x0BU << DAC_CR_MAMP2_Pos)             ///< Triangle wave amplitude equal to 4095
    #define DAC_CR_DMAEN2_Pos           (28)
    #define DAC_CR_DMAEN2               (0x01U << DAC_CR_DMAEN2_Pos)            ///< DAC channel2 DMA enabled

////////////////////////////////////////////////////////////////////////////////
/// @brief DAC_SWTRIGR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
    #define DAC_SWTRIGR_SWTRIG1_Pos     (0)
    #define DAC_SWTRIGR_SWTRIG1         (0x01U << DAC_SWTRIGR_SWTRIG1_Pos)      ///< DAC channel1 software trigger
    #define DAC_SWTRIGR_SWTRIG2_Pos     (1)
    #define DAC_SWTRIGR_SWTRIG2         (0x01U << DAC_SWTRIGR_SWTRIG2_Pos)      ///< DAC channel2 software trigger
    #define DAC_SWTRIGR_DACPRE_Pos      (8)
    #define DAC_SWTRIGR_DACPRE          (0x7FU << DAC_SWTRIGR_DACPRE_Pos)       ///< DAC prescale

////////////////////////////////////////////////////////////////////////////////
/// @brief DAC_DHR12R1 Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
    #define DAC_DHR12R1_DACC1DHR_Pos    (0)
    #define DAC_DHR12R1_DACC1DHR        (0xFFFU << DAC_DHR12R1_DACC1DHR_Pos)    ///< DAC channel1 12-bit Right align data

////////////////////////////////////////////////////////////////////////////////
/// @brief DAC_DHR12L1 Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
    #define DAC_DHR12L1_DACC1DHR_Pos    (4)
    #define DAC_DHR12L1_DACC1DHR        (0xFFFU << DAC_DHR12L1_DACC1DHR_Pos)    ///< DAC channel1 12-bit Left align data

////////////////////////////////////////////////////////////////////////////////
/// @brief DAC_DHR8R1 Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
    #define DAC_DHR8R1_DACC1DHR_Pos     (0)
    #define DAC_DHR8R1_DACC1DHR         (0xFFU << DAC_DHR8R1_DACC1DHR_Pos)      ///< DAC channel1 8-bit Right align data

////////////////////////////////////////////////////////////////////////////////
/// @brief DAC_DHR12R2 Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
    #define DAC_DHR12R2_DACC2DHR_Pos    (0)
    #define DAC_DHR12R2_DACC2DHR        (0xFFFU << DAC_DHR12R2_DACC2DHR_Pos)    ///< DAC channel2 12-bit Right align data

////////////////////////////////////////////////////////////////////////////////
/// @brief DAC_DHR12L2 Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
    #define DAC_DHR12L2_DACC2DHR_Pos    (4)
    #define DAC_DHR12L2_DACC2DHR        (0xFFFU << DAC_DHR12L2_DACC2DHR_Pos)    ///< DAC channel2 12-bit Left align data

////////////////////////////////////////////////////////////////////////////////
/// @brief DAC_DHR8R2 Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
    #define DAC_DHR8R2_DACC2DHR_Pos     (0)
    #define DAC_DHR8R2_DACC2DHR         (0xFFU << DAC_DHR8R2_DACC2DHR_Pos)      ///< DAC channel2 8-bit Right align data

////////////////////////////////////////////////////////////////////////////////
/// @brief DAC_DHR12RD Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
    #define DAC_DHR12RD_DACC1DHR_Pos    (0)
    #define DAC_DHR12RD_DACC1DHR        (0xFFFU << DAC_DHR12RD_DACC1DHR_Pos)    ///< DAC channel1 12-bit Right align data
    #define DAC_DHR12RD_DACC2DHR_Pos    (16)
    #define DAC_DHR12RD_DACC2DHR        (0xFFFU << DAC_DHR12RD_DACC2DHR_Pos)    ///< DAC channel2 12-bit Right align data

////////////////////////////////////////////////////////////////////////////////
/// @brief DAC_DHR12LD Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
    #define DAC_DHR12LD_DACC1DHR_Pos    (4)
    #define DAC_DHR12LD_DACC1DHR        (0xFFFU << DAC_DHR12LD_DACC1DHR_Pos)    ///< DAC channel1 12-bit Right align data
    #define DAC_DHR12LD_DACC2DHR_Pos    (20)
    #define DAC_DHR12LD_DACC2DHR        (0xFFFU << DAC_DHR12LD_DACC2DHR_Pos)    ///< DAC channel2 12-bit Right align data

////////////////////////////////////////////////////////////////////////////////
/// @brief DAC_DHR8RD Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
    #define DAC_DHR8RD_DACC1DHR_Pos     (0)
    #define DAC_DHR8RD_DACC1DHR         (0xFFU << DAC_DHR8RD_DACC1DHR_Pos)      ///< DAC channel1 8-bit Right align data
    #define DAC_DHR8RD_DACC2DHR_Pos     (8)
    #define DAC_DHR8RD_DACC2DHR         (0xFFU << DAC_DHR8RD_DACC2DHR_Pos)      ///< DAC channel2 8-bit Right align data

////////////////////////////////////////////////////////////////////////////////
/// @brief DAC_DOR1 Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
    #define DAC_DOR1_DACC1DOR_Pos       (0)
    #define DAC_DOR1_DACC1DOR           (0xFFFU << DAC_DOR1_DACC1DOR_Pos)       ///< DAC channel1 data output

////////////////////////////////////////////////////////////////////////////////
/// @brief DAC_DOR2 Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
    #define DAC_DOR2_DACC2DOR_Pos       (0)
    #define DAC_DOR2_DACC2DOR           (0xFFFU << DAC_DOR2_DACC2DOR_Pos)       ///< DAC channel2 data output #endif
#endif

////////////////////////////////////////////////////////////////////////////////
/// @brief DBGMCU_IDCODE Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define DEV_ID_Pos                      (0)
#define DEV_ID                          (0xFFFFFFFFU << DEV_ID_Pos)             ///< Device identifier

////////////////////////////////////////////////////////////////////////////////
/// @brief DBGMCU_CR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define DBG_SLEEP_Pos                   (0)
#define DBG_SLEEP                       (0x01U << DBG_SLEEP_Pos)                ///< Debug Sleep mode
#define DBG_STOP_Pos                    (1)
#define DBG_STOP                        (0x01U << DBG_STOP_Pos)                 ///< Debug Stop mode
#define DBG_STANDBY_Pos                 (2)
#define DBG_STANDBY                     (0x01U << DBG_STANDBY_Pos)              ///< Debug Standby mode
#define DBG_IWDG_STOP_Pos               (8)
#define DBG_IWDG_STOP                   (0x01U << DBG_IWDG_STOP_Pos)            ///< Debug independent watchdog stopped when core is halted
#define DBG_WWDG_STOP_Pos               (9)
#define DBG_WWDG_STOP                   (0x01U << DBG_WWDG_STOP_Pos)            ///< Debug window watchdog stopped when core is halted
#define DBG_TIMn_STOP_Pos               (10)
#define DBG_TIM1_STOP                   (0x01U << DBG_TIMn_STOP_Pos)            ///< TIM1 counter stopped when core is halted
#define DBG_TIM2_STOP                   (0x02U << DBG_TIMn_STOP_Pos)            ///< TIM2 counter stopped when core is halted
#define DBG_TIM3_STOP                   (0x04U << DBG_TIMn_STOP_Pos)            ///< TIM3 counter stopped when core is halted

