mm32/MM32_FDS/library/startup/inc/_mm32.h
#if defined(__MM0P1) || defined(__MM0Q1)
    #define DMA_CCR_ARE_Pos             (15)
    #define DMA_CCR_ARE                 (0x01U << DMA_CCR_ARE_Pos)              ///< Auto-Reload Enable bit
#endif

////////////////////////////////////////////////////////////////////////////////
/// @brief DMA_CNDTR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define DMA_CNDTR_NDT_Pos               (0)
#define DMA_CNDTR_NDT                   (0xFFFFU << DMA_CNDTR_NDT_Pos)          ///< Number of data to Transfer

////////////////////////////////////////////////////////////////////////////////
/// @brief DMA_CPAR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define DMA_CPAR_PA_Pos                 (0)
#define DMA_CPAR_PA                     (0xFFFFFFFFU << DMA_CPAR_PA_Pos)        ///< Peripheral Address

////////////////////////////////////////////////////////////////////////////////
/// @brief DMA_CMAR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define DMA_CMAR_MA_Pos                 (0)
#define DMA_CMAR_MA                     (0xFFFFFFFFU << DMA_CMAR_MA_Pos)        ///< Peripheral Address

////////////////////////////////////////////////////////////////////////////////
/// @brief EXTI_CFGR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#if defined(__MM0N1) || defined(__MM0P1) || defined(__MM0Q1)
    #define EXTI_CFGR_MEMMODE_Pos       (0)
    #define EXTI_CFGR_MEMMODE           (0x03U << EXTI_CFGR_MEMMODE_Pos)        ///< EXTI_Memory Remap Config
    #define EXTI_CFGR_MEMMODE_0         (0x01U << EXTI_CFGR_MEMMODE_Pos)        ///< EXTI_Memory Remap Config Bit 0
    #define EXTI_CFGR_MEMMODE_1         (0x02U << EXTI_CFGR_MEMMODE_Pos)        ///< EXTI_Memory Remap Config Bit 1
    #define EXTI_CFGR_ADCDMA_Pos        (8)
    #define EXTI_CFGR_ADCDMA_           (0x01U << EXTI_CFGR_ADCDMA_Pos)         ///< ADC DMA remap
    #define EXTI_CFGR_TIM16DMA_Pos      (11)
    #define EXTI_CFGR_TIM16DMA_         (0x01U << EXTI_CFGR_TIM16DMA_Pos)       ///< Timer 16 DMA remap
    #define EXTI_CFGR_TIM17DMA_Pos      (12)
    #define EXTI_CFGR_TIM17DMA_         (0x01U << EXTI_CFGR_TIM17DMA_Pos)       ///< Timer 17 DMA remap
#endif

#if defined(__MM0N1) || defined(__MM0Q1)
    #define EXTI_CFGR_UART1TXDMA_Pos    (9)
    #define EXTI_CFGR_UART1TXDMA_       (0x01U << EXTI_CFGR_UART1TXDMA_Pos)     ///< UART1 TX DMA remap
    #define EXTI_CFGR_UART1RXDMA_Pos    (10)
    #define EXTI_CFGR_UART1RXDMA_       (0x01U << EXTI_CFGR_UART1RXDMA_Pos)     ///< UART1 RX DMA remap
#endif


////////////////////////////////////////////////////////////////////////////////
/// @brief EXTI_MAPR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
    #define EXTI_MAPR_SPI1_Pos          (0)
    #define EXTI_MAPR_SPI1              (0x01U << EXTI_MAPR_SPI1_Pos)           ///< SPI1 remapping
    #define EXTI_MAPR_I2C1_Pos          (1)
    #define EXTI_MAPR_I2C1              (0x01U << EXTI_MAPR_I2C1_Pos)           ///< I2C1 remapping
    #define EXTI_MAPR_UART1_Pos         (2)
    #define EXTI_MAPR_UART1             (0x01U << EXTI_MAPR_UART1_Pos)          ///< UART1 remapping
    #define EXTI_MAPR_UART3_Pos         (4)
    #define EXTI_MAPR_UART3_MASK        (0x03U << EXTI_MAPR_UART3_Pos)          ///< UART3[1:0] bits (UART3 remapping)
    #define EXTI_MAPR_UART3             (0x01U << EXTI_MAPR_UART3_Pos)          ///< UART3_Partial REMAP[1:0] bits (UART3 remapping)
    #define EXTI_MAPR_TIM1_Pos          (6)
    #define EXTI_MAPR_TIM1_MASK         (0x03U << EXTI_MAPR_TIM1_Pos)           ///< TIM1[1:0] bits (TIM1 remapping)
    #define EXTI_MAPR_TIM1              (0x03U << EXTI_MAPR_TIM1_Pos)           ///< TIM1[1:0] bits (TIM1 remapping)
    #define EXTI_MAPR_TIM1_PARTIAL      (0x01U << EXTI_MAPR_TIM1_Pos)           ///< Partial remap (ETR/PA12, CH1/PA8, CH2/PA9, CH3/PA10, CH4/PA11, BKIN/PA6, CH1N/PA7, CH2N/PB0, CH3N/PB1)
    #define EXTI_MAPR_TIM2_Pos          (8)
    #define EXTI_MAPR_TIM2_MASK         (0x03U << EXTI_MAPR_TIM2_Pos)           ///< TIM2[1:0] bits (TIM2 remapping)
    #define EXTI_MAPR_TIM2              (0x03U << EXTI_MAPR_TIM2_Pos)           ///< Full remap (CH1/ETR/PA15, CH2/PB3, CH3/PB10, CH4/PB11)
    #define EXTI_MAPR_TIM2_PARTIAL1     (0x01U << EXTI_MAPR_TIM2_Pos)           ///< Partial remap (CH1/ETR/PA15, CH2/PB3, CH3/PA2, CH4/PA3)
    #define EXTI_MAPR_TIM2_PARTIAL2     (0x02U << EXTI_MAPR_TIM2_Pos)           ///< Partial remap (CH1/ETR/PA0, CH2/PA1, CH3/PB10, CH4/PB11)
    #define EXTI_MAPR_TIM3_Pos          (10)
    #define EXTI_MAPR_TIM3_MASK         (0x03U << EXTI_MAPR_TIM3_Pos)           ///< TIM3[1:0] bits (TIM3 remapping)
    #define EXTI_MAPR_TIM3              (0x03U << EXTI_MAPR_TIM3_Pos)           ///< Full remap (CH1/PC6, CH2/PC7, CH3/PC8, CH4/PC9)
    #define EXTI_MAPR_TIM3_PARTIAL      (0x02U << EXTI_MAPR_TIM3_Pos)           ///< Partial remap (CH1/PB4, CH2/PB5, CH3/PB0, CH4/PB1)
    #define EXTI_MAPR_CAN_Pos           (13)
    #define EXTI_MAPR_CAN_MASK          (0x03U << EXTI_MAPR_CAN_Pos)            ///< CAN[1:0] bits (CAN Alternate function remapping)
    #define EXTI_MAPR_CAN               (0x02U << EXTI_MAPR_CAN_Pos)            ///< CANRX mapped to PB8, CANTX mapped to PB9
    #define EXTI_MAPR_PD01_Pos          (15)
    #define EXTI_MAPR_PD01              (0x01U << EXTI_MAPR_PD01_Pos)           ///< Port D0/Port D1 mapping on OSC_IN/OSC_OUT
    #define EXTI_MAPR_SWJ_Pos           (24)
    #define EXTI_MAPR_SWJ_MASK          (0x07U << EXTI_MAPR_SWJ_Pos)            ///< SWJ_CFG[2:0] bits (Serial Wire JTAG configuration)
    #define EXTI_MAPR_SWJ               (0x00U << EXTI_MAPR_SWJ_Pos)            ///< Full SWJ (JTAG-DP + SW-DP), Reset state
    #define EXTI_MAPR_SWJ_NOJNTRST      (0x01U << EXTI_MAPR_SWJ_Pos)            ///< Full SWJ (JTAG-DP + SW-DP) but without JNTRST
    #define EXTI_MAPR_SWJ_JTAGDISABLE   (0x02U << EXTI_MAPR_SWJ_Pos)            ///< JTAG-DP Disabled and SW-DP Enabled
    #define EXTI_MAPR_SWJ_DISABLE       (0x04U << EXTI_MAPR_SWJ_Pos)            ///< JTAG-DP Disabled and SW-DP Disabled


////////////////////////////////////////////////////////////////////////////////
/// @brief EXTI_CR1 Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
    #define EXTI_CR1_EXTI0_Pos          (0)
    #define EXTI_CR1_EXTI0              (0x0FU << EXTI_CR1_EXTI0_Pos)           ///< EXTI 0 configuration
    #define EXTI_CR1_EXTI0_PA           (0x00U << EXTI_CR1_EXTI0_Pos)           ///< PA[0] pin
    #define EXTI_CR1_EXTI0_PB           (0x01U << EXTI_CR1_EXTI0_Pos)           ///< PB[0] pin
    #define EXTI_CR1_EXTI0_PC           (0x02U << EXTI_CR1_EXTI0_Pos)           ///< PC[0] pin
    #define EXTI_CR1_EXTI0_PD           (0x03U << EXTI_CR1_EXTI0_Pos)           ///< PD[0] pin

    #define EXTI_CR1_EXTI1_Pos          (4)
    #define EXTI_CR1_EXTI1              (0x0FU << EXTI_CR1_EXTI1_Pos)           ///< EXTI 1 configuration
    #define EXTI_CR1_EXTI1_PA           (0x00U << EXTI_CR1_EXTI1_Pos)           ///< PA[1] pin
    #define EXTI_CR1_EXTI1_PB           (0x01U << EXTI_CR1_EXTI1_Pos)           ///< PB[1] pin
    #define EXTI_CR1_EXTI1_PC           (0x02U << EXTI_CR1_EXTI1_Pos)           ///< PC[1] pin
    #define EXTI_CR1_EXTI1_PD           (0x03U << EXTI_CR1_EXTI1_Pos)           ///< PD[1] pin

    #define EXTI_CR1_EXTI2_Pos          (8)
    #define EXTI_CR1_EXTI2              (0x0FU << EXTI_CR1_EXTI2_Pos)           ///< EXTI 2 configuration
    #define EXTI_CR1_EXTI2_PA           (0x00U << EXTI_CR1_EXTI2_Pos)           ///< PA[2] pin
    #define EXTI_CR1_EXTI2_PB           (0x01U << EXTI_CR1_EXTI2_Pos)           ///< PB[2] pin
    #define EXTI_CR1_EXTI2_PC           (0x02U << EXTI_CR1_EXTI2_Pos)           ///< PC[2] pin
    #define EXTI_CR1_EXTI2_PD           (0x03U << EXTI_CR1_EXTI2_Pos)           ///< PD[2] pin

    #define EXTI_CR1_EXTI3_Pos          (12)
    #define EXTI_CR1_EXTI3              (0x0FU << EXTI_CR1_EXTI3_Pos)           ///< EXTI 3 configuration
    #define EXTI_CR1_EXTI3_PA           (0x00U << EXTI_CR1_EXTI3_Pos)           ///< PA[3] pin
    #define EXTI_CR1_EXTI3_PB           (0x01U << EXTI_CR1_EXTI3_Pos)           ///< PB[3] pin
    #define EXTI_CR1_EXTI3_PC           (0x02U << EXTI_CR1_EXTI3_Pos)           ///< PC[3] pin
    #define EXTI_CR1_EXTI3_PD           (0x03U << EXTI_CR1_EXTI3_Pos)           ///< PD[3] pin

////////////////////////////////////////////////////////////////////////////////
/// @brief EXTI_CR2 Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
    #define EXTI_CR2_EXTI4_Pos          (0)
    #define EXTI_CR2_EXTI4              (0x0FU << EXTI_CR2_EXTI4_Pos)           ///< EXTI 4 configuration
    #define EXTI_CR2_EXTI4_PA           (0x00U << EXTI_CR2_EXTI4_Pos)           ///< PA[4] pin
    #define EXTI_CR2_EXTI4_PB           (0x01U << EXTI_CR2_EXTI4_Pos)           ///< PB[4] pin
    #define EXTI_CR2_EXTI4_PC           (0x02U << EXTI_CR2_EXTI4_Pos)           ///< PC[4] pin
    #define EXTI_CR2_EXTI4_PD           (0x03U << EXTI_CR2_EXTI4_Pos)           ///< PD[4] pin

    #define EXTI_CR2_EXTI5_Pos          (4)
    #define EXTI_CR2_EXTI5              (0x0FU << EXTI_CR2_EXTI5_Pos)           ///< EXTI 5 configuration
    #define EXTI_CR2_EXTI5_PA           (0x00U << EXTI_CR2_EXTI5_Pos)           ///< PA[5] pin
    #define EXTI_CR2_EXTI5_PB           (0x01U << EXTI_CR2_EXTI5_Pos)           ///< PB[5] pin
    #define EXTI_CR2_EXTI5_PC           (0x02U << EXTI_CR2_EXTI5_Pos)           ///< PC[5] pin
    #define EXTI_CR2_EXTI5_PD           (0x03U << EXTI_CR2_EXTI5_Pos)           ///< PD[5] pin

    #define EXTI_CR2_EXTI6_Pos          (8)
    #define EXTI_CR2_EXTI6              (0x0FU << EXTI_CR2_EXTI6_Pos)           ///< EXTI 6 configuration
    #define EXTI_CR2_EXTI6_PA           (0x00U << EXTI_CR2_EXTI6_Pos)           ///< PA[6] pin
    #define EXTI_CR2_EXTI6_PB           (0x01U << EXTI_CR2_EXTI6_Pos)           ///< PB[6] pin
    #define EXTI_CR2_EXTI6_PC           (0x02U << EXTI_CR2_EXTI6_Pos)           ///< PC[6] pin
    #define EXTI_CR2_EXTI6_PD           (0x03U << EXTI_CR2_EXTI6_Pos)           ///< PD[6] pin

    #define EXTI_CR2_EXTI7_Pos          (12)
    #define EXTI_CR2_EXTI7              (0x0FU << EXTI_CR2_EXTI7_Pos)           ///< EXTI 7 configuration
    #define EXTI_CR2_EXTI7_PA           (0x00U << EXTI_CR2_EXTI7_Pos)           ///< PA[7] pin
    #define EXTI_CR2_EXTI7_PB           (0x01U << EXTI_CR2_EXTI7_Pos)           ///< PB[7] pin
    #define EXTI_CR2_EXTI7_PC           (0x02U << EXTI_CR2_EXTI7_Pos)           ///< PC[7] pin
    #define EXTI_CR2_EXTI7_PD           (0x03U << EXTI_CR2_EXTI7_Pos)           ///< PD[7] pin

////////////////////////////////////////////////////////////////////////////////
/// @brief EXTI_CR3 Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
    #define EXTI_CR3_EXTI8_Pos          (0)
    #define EXTI_CR3_EXTI8              (0x0FU << EXTI_CR3_EXTI8_Pos)           ///< EXTI 8 configuration
    #define EXTI_CR3_EXTI8_PA           (0x00U << EXTI_CR3_EXTI8_Pos)           ///< PA[8] pin
    #define EXTI_CR3_EXTI8_PB           (0x01U << EXTI_CR3_EXTI8_Pos)           ///< PB[8] pin
    #define EXTI_CR3_EXTI8_PC           (0x02U << EXTI_CR3_EXTI8_Pos)           ///< PC[8] pin
    #define EXTI_CR3_EXTI8_PD           (0x03U << EXTI_CR3_EXTI8_Pos)           ///< PD[8] pin

