mm32/MM32_FDS/library/startup/inc/_mm32.h
#if defined(__MM3N1) || defined(__MM3O1)
    #define EXTI_RTSR_17_Pos            (17)
    #define EXTI_RTSR_17                (0x01U << EXTI_RTSR_17_Pos)             ///< Rising trigger event configuration bit of line 17
#endif

#if defined(__MM3N1) || defined(__MM0N1) || defined(__MM3O1)
    #define EXTI_RTSR_18_Pos            (18)
    #define EXTI_RTSR_18                (0x01U << EXTI_RTSR_18_Pos)             ///< Rising trigger event configuration bit of line 18
#endif

#define EXTI_RTSR_19_Pos                (19)
#define EXTI_RTSR_19                    (0x01U << EXTI_RTSR_19_Pos)             ///< Rising trigger event configuration bit of line 19

#if defined(__MM3N1) || defined(__MM0N1) || defined(__MM3O1)|| defined(__MM0P1)
    #define EXTI_RTSR_20_Pos            (20)
    #define EXTI_RTSR_20                (0x01U << EXTI_RTSR_20_Pos)             ///< Rising trigger event configuration bit of line 20
#endif

#if defined(__MM3O1) || defined(__MM0P1)
    #define EXTI_RTSR_21_Pos            (21)
    #define EXTI_RTSR_21                (0x01U << EXTI_RTSR_21_Pos)             ///< Rising trigger event configuration bit of line 21
#endif

#if defined(__MM0P1)
    #define EXTI_RTSR_22_Pos            (22)
    #define EXTI_RTSR_22                (0x01U << EXTI_RTSR_22_Pos)             ///< Rising trigger event configuration bit of line 22
    #define EXTI_RTSR_23_Pos            (23)
    #define EXTI_RTSR_23                (0x01U << EXTI_RTSR_23_Pos)             ///< Rising trigger event configuration bit of line 23
#endif

#if defined(__MM0P1) || defined(__MM0Q1)
    #define EXTI_RTSR_24_Pos            (24)
    #define EXTI_RTSR_24                (0x01U << EXTI_RTSR_24_Pos)             ///< Rising trigger event configuration bit of line 24
#endif

////////////////////////////////////////////////////////////////////////////////
/// @brief EXTI_FTSR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define EXTI_FTSR_0_Pos                 (0)
#define EXTI_FTSR_0                     (0x01U << EXTI_FTSR_0_Pos)              ///< Falling trigger event configuration bit of line 0
#define EXTI_FTSR_1_Pos                 (1)
#define EXTI_FTSR_1                     (0x01U << EXTI_FTSR_1_Pos)              ///< Falling trigger event configuration bit of line 1
#define EXTI_FTSR_2_Pos                 (2)
#define EXTI_FTSR_2                     (0x01U << EXTI_FTSR_2_Pos)              ///< Falling trigger event configuration bit of line 2
#define EXTI_FTSR_3_Pos                 (3)
#define EXTI_FTSR_3                     (0x01U << EXTI_FTSR_3_Pos)              ///< Falling trigger event configuration bit of line 3
#define EXTI_FTSR_4_Pos                 (4)
#define EXTI_FTSR_4                     (0x01U << EXTI_FTSR_4_Pos)              ///< Falling trigger event configuration bit of line 4
#define EXTI_FTSR_5_Pos                 (5)
#define EXTI_FTSR_5                     (0x01U << EXTI_FTSR_5_Pos)              ///< Falling trigger event configuration bit of line 5
#define EXTI_FTSR_6_Pos                 (6)
#define EXTI_FTSR_6                     (0x01U << EXTI_FTSR_6_Pos)              ///< Falling trigger event configuration bit of line 6
#define EXTI_FTSR_7_Pos                 (7)
#define EXTI_FTSR_7                     (0x01U << EXTI_FTSR_7_Pos)              ///< Falling trigger event configuration bit of line 7
#define EXTI_FTSR_8_Pos                 (8)
#define EXTI_FTSR_8                     (0x01U << EXTI_FTSR_8_Pos)              ///< Falling trigger event configuration bit of line 8
#define EXTI_FTSR_9_Pos                 (9)
#define EXTI_FTSR_9                     (0x01U << EXTI_FTSR_9_Pos)              ///< Falling trigger event configuration bit of line 9
#define EXTI_FTSR_10_Pos                (10)
#define EXTI_FTSR_10                    (0x01U << EXTI_FTSR_10_Pos)             ///< Falling trigger event configuration bit of line 10
#define EXTI_FTSR_11_Pos                (11)
#define EXTI_FTSR_11                    (0x01U << EXTI_FTSR_11_Pos)             ///< Falling trigger event configuration bit of line 11
#define EXTI_FTSR_12_Pos                (12)
#define EXTI_FTSR_12                    (0x01U << EXTI_FTSR_12_Pos)             ///< Falling trigger event configuration bit of line 12
#define EXTI_FTSR_13_Pos                (13)
#define EXTI_FTSR_13                    (0x01U << EXTI_FTSR_13_Pos)             ///< Falling trigger event configuration bit of line 13
#define EXTI_FTSR_14_Pos                (14)
#define EXTI_FTSR_14                    (0x01U << EXTI_FTSR_14_Pos)             ///< Falling trigger event configuration bit of line 14
#define EXTI_FTSR_15_Pos                (15)
#define EXTI_FTSR_15                    (0x01U << EXTI_FTSR_15_Pos)             ///< Falling trigger event configuration bit of line 15
#define EXTI_FTSR_16_Pos                (16)
#define EXTI_FTSR_16                    (0x01U << EXTI_FTSR_16_Pos)             ///< Falling trigger event configuration bit of line 16

#if defined(__MM3N1) || defined(__MM3O1)
    #define EXTI_FTSR_17_Pos            (17)
    #define EXTI_FTSR_17                (0x01U << EXTI_FTSR_17_Pos)             ///< Falling trigger event configuration bit of line 17
#endif

#if defined(__MM3N1) || defined(__MM0N1) || defined(__MM3O1)
    #define EXTI_FTSR_18_Pos            (18)
    #define EXTI_FTSR_18                (0x01U << EXTI_FTSR_18_Pos)             ///< Falling trigger event configuration bit of line 18
#endif

#define EXTI_FTSR_19_Pos                (19)
#define EXTI_FTSR_19                    (0x01U << EXTI_FTSR_19_Pos)             ///< Falling trigger event configuration bit of line 19

#if defined(__MM3N1) || defined(__MM0N1) || defined(__MM3O1)|| defined(__MM0P1)
    #define EXTI_FTSR_20_Pos            (20)
    #define EXTI_FTSR_20                (0x01U << EXTI_FTSR_20_Pos)             ///< Falling trigger event configuration bit of line 20
#endif

#if defined(__MM3O1) || defined(__MM0P1)
    #define EXTI_FTSR_21_Pos            (21)
    #define EXTI_FTSR_21                (0x01U << EXTI_FTSR_21_Pos)             ///< Falling trigger event configuration bit of line 21
#endif

#if defined(__MM0P1)
    #define EXTI_FTSR_22_Pos            (22)
    #define EXTI_FTSR_22                (0x01U << EXTI_FTSR_22_Pos)             ///< Falling trigger event configuration bit of line 22
    #define EXTI_FTSR_23_Pos            (23)
    #define EXTI_FTSR_23                (0x01U << EXTI_FTSR_23_Pos)             ///< Falling trigger event configuration bit of line 23
#endif

