mm32/MM32_FDS/library/startup/inc/_mm32.h
#if defined(__MM3O1)
    #define PWR_CR_VOS_Pos              (14)
    #define PWR_CR_VOS                  (0x01U  << PWR_CR_VOS_Pos)              ///< Modulator Voltage Output Selection
    #define PWR_CR_ODEN_Pos             (16)
    #define PWR_CR_ODEN                 (0x01U  << PWR_CR_ODEN_Pos)             ///< Overvoltage Enable
    #define PWR_CR_ODSWEN_Pos           (17)
    #define PWR_CR_ODSWEN               (0x01U  << PWR_CR_ODSWEN_Pos)           ///< Adjust Overvoltage Selection Enable
#endif

////////////////////////////////////////////////////////////////////////////////
/// @brief PWR_CSR register Bit definition
////////////////////////////////////////////////////////////////////////////////
#define PWR_CSR_WUF_Pos                 (0)
#define PWR_CSR_WUF                     (0x01U  << PWR_CSR_WUF_Pos)             ///< Wakeup Flag
#define PWR_CSR_SBF_Pos                 (1)
#define PWR_CSR_SBF                     (0x01U  << PWR_CSR_SBF_Pos)             ///< Standby Flag
#define PWR_CSR_PVDO_Pos                (2)
#define PWR_CSR_PVDO                    (0x01U  << PWR_CSR_PVDO_Pos)            ///< PVD Output
#define PWR_CSR_EWU_Pos                 (8)
#define PWR_CSR_EWUP                    (0x01U  << PWR_CSR_EWU_Pos)             ///< Enable WKUP pin

#if defined(__MM3O1)
    #define PWR_CR_VOSRDY_Pos           (14)
    #define PWR_CR_VOSRDY               (0x01U  << PWR_CR_VOSRDY_Pos)           ///< Voltage Modulator Output Selection Ready
    #define PWR_CR_ODRDY_Pos            (16)
    #define PWR_CR_ODRDY                (0x01U  << PWR_CR_ODRDY_Pos)            ///< Overvoltage Mode Ready
    #define PWR_CR_ODSWRDY_Pos          (17)
    #define PWR_CR_ODSWRDY              (0x01U  << PWR_CR_ODSWRDY_Pos)          ///< Overvoltage Mode Selection Ready
#endif

////////////////////////////////////////////////////////////////////////////////
/// @brief RCC_CR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define RCC_CR_HSION_Pos                (0)
#define RCC_CR_HSION                    (0x01U << RCC_CR_HSION_Pos)             ///< Internal High Speed clock enable

#define RCC_CR_HSIRDY_Pos               (1)
#define RCC_CR_HSIRDY                   (0x01U << RCC_CR_HSIRDY_Pos)            ///< Internal High Speed clock ready flag

#if defined(__MM3N1)
    #define  RCC_CR_HSICAL_Pos          (8)
    #define  RCC_CR_HSICAL              (0xFFU << RCC_CR_HSICAL_Pos)            ///< Internal High Speed clock Calibration
    #define  RCC_CR_HSITRIM_Pos         (2)
    #define  RCC_CR_HSITRIM             (0x3FU << RCC_CR_HSITRIM_Pos)           ///< Internal High Speed clock trimming
#endif

#if defined(__MM0N1) || defined(__MM0P1) || defined(__MM0Q1)
    #define  RCC_CR_HSICAL_Pos          (8)
    #define  RCC_CR_HSICAL              (0x3FU << RCC_CR_HSICAL_Pos)            ///< Internal High Speed clock Calibration
#endif

#define  RCC_CR_HSEON_Pos               (16)
#define  RCC_CR_HSEON                   (0x01U << RCC_CR_HSEON_Pos)             ///< External High Speed clock enable
#define  RCC_CR_HSERDY_Pos              (17)
#define  RCC_CR_HSERDY                  (0x01U << RCC_CR_HSERDY_Pos)            ///< External High Speed clock ready flag
#define  RCC_CR_HSEBYP_Pos              (18)
#define  RCC_CR_HSEBYP                  (0x01U << RCC_CR_HSEBYP_Pos)            ///< External High Speed clock Bypass
#define  RCC_CR_CSSON_Pos               (19)
#define  RCC_CR_CSSON                   (0x01U << RCC_CR_CSSON_Pos)             ///< Clock Security System enable

#if defined(__MM0Q1)
    #define  RCC_CR_HSI_72M_Pos         (20)
    #define  RCC_CR_HSI_72M             (0x01U << RCC_CR_HSI_72M_Pos)           ///< HSI output 72M
#endif

#if defined(__MM3N1) || defined(__MM0N1) || defined(__MM0P1)
    #define  RCC_CR_PLLON_Pos           (24)
    #define  RCC_CR_PLLON               (0x01U << RCC_CR_PLLON_Pos)             ///< PLL enable
    #define  RCC_CR_PLLRDY_Pos          (25)
    #define  RCC_CR_PLLRDY              (0x01U << RCC_CR_PLLRDY_Pos)            ///< PLL clock ready flag
    #define  RCC_CR_PLLMUL_Pos          (26)
    #define  RCC_CR_PLLMUL              (0x3FU << RCC_CR_PLLMUL_Pos)            ///< PLLMUL[5:0] bits
    #define  RCC_CR_PLLDIV_Pos          (20)
    #define  RCC_CR_PLLDIV              (0x07U << RCC_CR_PLLDIV_Pos)            ///< PLLDIV[2:0] bits
#endif

#if defined(__MM0N1) || defined(__MM0P1) || defined(__MM0Q1)
    #define  RCC_CR_HSITEN_Pos          (2)
    #define  RCC_CR_HSITEN              (0x01U << RCC_CR_HSITEN_Pos)            ///< HSI internal temperature enable
#endif

////////////////////////////////////////////////////////////////////////////////
/// @brief RCC_CFGR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define RCC_CFGR_SW_Pos                 (0)
#define RCC_CFGR_SW                     (0x03U << RCC_CFGR_SW_Pos)              ///< SW[1:0] bits (System clock Switch)
    #define RCC_CFGR_SW_HSI_DIV6        (0x00U << RCC_CFGR_SW_Pos)              ///< HSI/6 selected as system clock
    #define RCC_CFGR_SW_HSE             (0x01U << RCC_CFGR_SW_Pos)              ///< HSE selected as system clock
#if defined(__MM3N1) || defined(__MM0N1) || defined(__MM0P1)
    #define RCC_CFGR_SW_PLL             (0x02U << RCC_CFGR_SW_Pos)              ///< PLL selected as system clock
#endif
#if defined(__MM0Q1)
    #define RCC_CFGR_SW_HSI             (0x02U << RCC_CFGR_SW_Pos)              ///< HSI selected as system clock
#endif
#if defined(__MM0P1) || defined(__MM0P1)
    #define RCC_CFGR_SW_LSI             (0x03U << RCC_CFGR_SW_Pos)              ///< LSI selected as system clock
#endif

#define RCC_CFGR_SWS_Pos                (2)
#define RCC_CFGR_SWS                    (0x03U << RCC_CFGR_SWS_Pos)             ///< SWS[1:0] bits (System Clock Switch Status)
#define RCC_CFGR_SWS_HSI_DIV6           (0x00U << RCC_CFGR_SWS_Pos)             ///< HSI/6 oscillator used as system clock
#define RCC_CFGR_SWS_HSE                (0x01U << RCC_CFGR_SWS_Pos)             ///< HSE oscillator used as system clock
#if defined(__MM3N1) || defined(__MM0N1) || defined(__MM0P1)
    #define RCC_CFGR_SWS_PLL            (0x02U << RCC_CFGR_SWS_Pos)             ///< PLL used as system clock
#endif
#if defined(__MM0Q1)
    #define RCC_CFGR_SWS_HSI            (0x02U << RCC_CFGR_SWS_Pos)             ///< HSI used as system clock
#endif
#if defined(__MM0P1) || defined(__MM0Q1)
    #define RCC_CFGR_SWS_LSI            (0x03U << RCC_CFGR_SWS_Pos)             ///< LSI used as system clock
#endif


