mm32/MM32_FDS/library/startup/inc/_mm32.h
#define RCC_APB1RSTR_WWDG_Pos           (11)
#define RCC_APB1RSTR_WWDG               (0x01U << RCC_APB1RSTR_WWDG_Pos)        ///< Window Watchdog reset
#define RCC_APB1RSTR_SPI2_Pos           (14)
#define RCC_APB1RSTR_SPI2               (0x01U << RCC_APB1RSTR_SPI2_Pos)        ///< SPI 2 reset
#define RCC_APB1RSTR_UART2_Pos          (17)
#define RCC_APB1RSTR_UART2              (0x01U << RCC_APB1RSTR_UART2_Pos)       ///< UART 2 reset

#if defined(__MM3N1)
    #define RCC_APB1RSTR_UART3_Pos      (18)
    #define RCC_APB1RSTR_UART3          (0x01U << RCC_APB1RSTR_UART3_Pos)       ///< UART 3 reset
#endif

#define RCC_APB1RSTR_I2C1_Pos           (21)
#define RCC_APB1RSTR_I2C1               (0x01U << RCC_APB1RSTR_I2C1_Pos)        ///< I2C 1 reset

#if defined(__MM3N1)
    #define RCC_APB1RSTR_I2C2_Pos       (22)
    #define RCC_APB1RSTR_I2C2           (0x01U << RCC_APB1RSTR_I2C2_Pos)        ///< I2C 2 reset
#endif

#if defined(__MM3N1) || defined(__MM0N1)
    #define RCC_APB1RSTR_USB_Pos        (23)
    #define RCC_APB1RSTR_USB            (0x01U << RCC_APB1RSTR_USB_Pos)         ///< USB reset
    #define RCC_APB1RSTR_CAN_Pos        (25)
    #define RCC_APB1RSTR_CAN            (0x01U << RCC_APB1RSTR_CAN_Pos)         ///< CAN reset
#endif

#if defined(__MM3N1)
    #define RCC_APB1RSTR_BKP_Pos        (27)
    #define RCC_APB1RSTR_BKP            (0x01U << RCC_APB1RSTR_BKP_Pos)         ///< Backup interface reset
#endif

#if defined(__MM0N1)
    #define RCC_APB1RSTR_CRS_Pos        (27)
    #define RCC_APB1RSTR_CRS            (0x01U << RCC_APB1RSTR_CRS_Pos)         ///< CRS interface reset
#endif

#define RCC_APB1RSTR_PWR_Pos            (28)
#define RCC_APB1RSTR_PWR                (0x01U << RCC_APB1RSTR_PWR_Pos)         ///< Power interface reset

#if defined(__MM3N1)
    #define RCC_APB1RSTR_DAC_Pos        (29)
    #define RCC_APB1RSTR_DAC            (0x01U << RCC_APB1RSTR_DAC_Pos)         ///< DAC interface reset
#endif

////////////////////////////////////////////////////////////////////////////////
/// @brief RCC_AHBENR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define RCC_AHBENR_DMA1_Pos             (0)
#define RCC_AHBENR_DMA1                 (0x01U << RCC_AHBENR_DMA1_Pos)          ///< DMA clock enable
#define RCC_AHBENR_SRAM_Pos             (2)
#define RCC_AHBENR_SRAM                 (0x01U << RCC_AHBENR_SRAM_Pos)          ///< SRAM interface clock enable
#define RCC_AHBENR_FLITF_Pos            (4)
#define RCC_AHBENR_FLITF                (0x01U << RCC_AHBENR_FLITF_Pos)         ///< FLITF clock enable
#define RCC_AHBENR_CRC_Pos              (6)
#define RCC_AHBENR_CRC                  (0x01U << RCC_AHBENR_CRC_Pos)           ///< Internal High Speed clock Calibration

#if defined(__MM3N1) || defined(__MM0N1)
    #define RCC_AHBENR_AES_Pos          (7)
    #define RCC_AHBENR_AES              (0x01U << RCC_AHBENR_AES_Pos)           ///< AES clock enable
#endif

#if defined(__MM0N1) || defined(__MM0P1) || defined(__MM0Q1)
    #define RCC_AHBENR_GPIOA_Pos        (17)
    #define RCC_AHBENR_GPIOA            (0x01U << RCC_AHBENR_GPIOA_Pos)         ///< GPIOA clock enable
    #define RCC_AHBENR_GPIOB_Pos        (18)
    #define RCC_AHBENR_GPIOB            (0x01U << RCC_AHBENR_GPIOB_Pos)         ///< GPIOB clock enable
    #define RCC_AHBENR_GPIOC_Pos        (19)
    #define RCC_AHBENR_GPIOC            (0x01U << RCC_AHBENR_GPIOC_Pos)         ///< GPIOC clock enable
    #define RCC_AHBENR_GPIOD_Pos        (20)
    #define RCC_AHBENR_GPIOD            (0x01U << RCC_AHBENR_GPIOD_Pos)         ///< GPIOD clock enable
#endif

#if defined(__MM0N1)
    #define RCC_AHBENR_GPIOE_Pos        (21)
    #define RCC_AHBENR_GPIOE            (0x01U << RCC_AHBENR_GPIOE_Pos)         ///< GPIOE clock enable
#endif

#if defined(__MM0P1)
    #define RCC_AHBENR_HWSQRT_Pos       (25)
    #define RCC_AHBENR_HWSQRT           (0x01U << RCC_AHBENR_HWSQRT_Pos)        ///< HWSQRT clock enable
#endif

#if defined(__MM0Q1) || defined(__MM0P1)
    #define RCC_AHBENR_HWDIV_Pos        (26)
    #define RCC_AHBENR_HWDIV            (0x01U << RCC_AHBENR_HWDIV_Pos)         ///< HWDIV clock enable
#endif

////////////////////////////////////////////////////////////////////////////////
/// @brief RCC_APB2ENR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
    #define RCC_APB2ENR_EXTI_Pos        (0)
    #define RCC_APB2ENR_EXTI            (0x01U << RCC_APB2ENR_EXTI_Pos)         ///< EXTI register enable

#if defined(__MM3N1)
    #define RCC_APB2ENR_GPIOA_Pos       (2)
    #define RCC_APB2ENR_GPIOA           (0x01U << RCC_APB2ENR_GPIOA_Pos)        ///< I/O port A clock enable
    #define RCC_APB2ENR_GPIOB_Pos       (3)
    #define RCC_APB2ENR_GPIOB           (0x01U << RCC_APB2ENR_GPIOB_Pos)        ///< I/O port B clock enable
    #define RCC_APB2ENR_GPIOC_Pos       (4)
    #define RCC_APB2ENR_GPIOC           (0x01U << RCC_APB2ENR_GPIOC_Pos)        ///< I/O port C clock enable
    #define RCC_APB2ENR_GPIOD_Pos       (5)
    #define RCC_APB2ENR_GPIOD           (0x01U << RCC_APB2ENR_GPIOD_Pos)        ///< I/O port D clock enable
    #define RCC_APB2ENR_GPIOE_Pos       (6)
    #define RCC_APB2ENR_GPIOE           (0x01U << RCC_APB2ENR_GPIOE_Pos)        ///< I/O port E clock enable
#endif

#define RCC_APB2ENR_ADC1_Pos            (9)
#define RCC_APB2ENR_ADC1                (0x01U << RCC_APB2ENR_ADC1_Pos)         ///< ADC 1 interface clock enable

#if defined(__MM3N1) || defined(__MM0P1)
    #define RCC_APB2ENR_ADC2_Pos        (10)
    #define RCC_APB2ENR_ADC2            (0x01U << RCC_APB2ENR_ADC2_Pos)         ///< ADC 2 interface clock enable
#endif

#if defined(__MM0P1)
    #define RCC_APB2ENR_TIM8_Pos        (13)
    #define RCC_APB2ENR_TIM8            (0x01U << RCC_APB2ENR_TIM8_Pos)         ///< TIM8 Timer reset
#endif

#define RCC_APB2ENR_TIM1_Pos            (11)
#define RCC_APB2ENR_TIM1                (0x01U << RCC_APB2ENR_TIM1_Pos)         ///< TIM1 Timer clock enable
#define RCC_APB2ENR_SPI1_Pos            (12)
#define RCC_APB2ENR_SPI1                (0x01U << RCC_APB2ENR_SPI1_Pos)         ///< SPI 1 clock enable
#define RCC_APB2ENR_UART1_Pos           (14)
#define RCC_APB2ENR_UART1               (0x01U << RCC_APB2ENR_UART1_Pos)        ///< UART1 clock enable
#define RCC_APB2ENR_COMP_Pos            (15)
#define RCC_APB2ENR_COMP                (0x01U << RCC_APB2ENR_COMP_Pos)         ///< Comparator interface clock enable

