mm32/MM32_FDS/library/startup/inc/_mm32.h
#if defined(__MM0P1) || defined(__MM0Q1)
    #define TIM_CCER_CC5E_Pos           (16)
    #define TIM_CCER_CC5E               (0x01U << TIM_CCER_CC5E_Pos)            ///< Capture/Compare 5 output enable
    #define TIM_CCER_CC5P_Pos           (17)
    #define TIM_CCER_CC5P               (0x01U << TIM_CCER_CC5P_Pos)            ///< Capture/Compare 5 output Polarity
#endif

////////////////////////////////////////////////////////////////////////////////
/// @brief TIM_CNT Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#if defined(__MM3N1) || defined(__MM3O1) || defined(__MM0Q1)
    #define TIM_CNT_CNT                 (0xFFFFU)                               ///< Counter Value
#endif

#if defined(__MM0N1) || defined(__MM0P1)
    #define TIM_CNT_CNT                 (0xFFFFFFFFU)                           ///< Counter Value
#endif

////////////////////////////////////////////////////////////////////////////////
/// @brief TIM_PSC Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define TIM_PSC_PSC                     (0xFFFFU)                               ///< Prescaler Value

////////////////////////////////////////////////////////////////////////////////
/// @brief TIM_ARR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#if defined(__MM3N1) || defined(__MM3O1) || defined(__MM0Q1)
    #define TIM_ARR_ARR                 (0xFFFFU)                               ///< actual auto-reload Value
#endif

#if defined(__MM0N1) || defined(__MM0P1)
    #define TIM_ARR_ARR                 (0xFFFFFFFFU)                           ///< actual auto-reload Value
#endif

////////////////////////////////////////////////////////////////////////////////
/// @brief TIM_RCR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define TIM_RCR_REP                     (0xFFU)                                 ///< Repetition Counter Value

////////////////////////////////////////////////////////////////////////////////
/// @brief TIM_CCR1 Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#if defined(__MM3N1) || defined(__MM3O1) || defined(__MM0Q1)
    #define TIM_CCR1_CCR1               (0xFFFFU)                               ///< Capture/Compare 1 Value
#endif

#if defined(__MM0N1) || defined(__MM0P1)
    #define TIM_CCR1_CCR1               (0xFFFFFFFFU)                           ///< Capture/Compare 1 Value
#endif

////////////////////////////////////////////////////////////////////////////////
/// @brief TIM_CCR2 Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#if defined(__MM3N1) || defined(__MM3O1) || defined(__MM0Q1)
    #define TIM_CCR2_CCR2               (0xFFFFU)                               ///< Capture/Compare 2 Value
#endif

#if defined(__MM0N1) || defined(__MM0P1)
    #define TIM_CCR2_CCR2               (0xFFFFFFFFU)                           ///< Capture/Compare 2 Value
#endif

////////////////////////////////////////////////////////////////////////////////
/// @brief TIM_CCR3 Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#if defined(__MM3N1) || defined(__MM3O1) || defined(__MM0Q1)
    #define TIM_CCR3_CCR3               (0xFFFFU)                               ///< Capture/Compare 3 Value
#endif

#if defined(__MM0N1) || defined(__MM0P1)
    #define TIM_CCR3_CCR3               (0xFFFFFFFFU)                           ///< Capture/Compare 3 Value
#endif

////////////////////////////////////////////////////////////////////////////////
/// @brief TIM_CCR4 Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#if defined(__MM3N1) || defined(__MM3O1) || defined(__MM0Q1)
    #define TIM_CCR4_CCR4               (0xFFFFU)                               ///< Capture/Compare 4 Value
#endif

#if defined(__MM0N1) || defined(__MM0P1)
    #define TIM_CCR4_CCR4               (0xFFFFFFFFU)                           ///< Capture/Compare 4 Value
#endif

////////////////////////////////////////////////////////////////////////////////
/// @brief TIM_BDTR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define TIM_BDTR_DTG_Pos                (0)
#define TIM_BDTR_DTG                    (0xFFU << TIM_BDTR_DTG_Pos)             ///< DTG[0:7] bits (Dead-Time Generator set-up)
#define TIM_BDTR_DTG_0                  (0x01U << TIM_BDTR_DTG_Pos)             ///< Bit 0
#define TIM_BDTR_DTG_1                  (0x02U << TIM_BDTR_DTG_Pos)             ///< Bit 1
#define TIM_BDTR_DTG_2                  (0x04U << TIM_BDTR_DTG_Pos)             ///< Bit 2
#define TIM_BDTR_DTG_3                  (0x08U << TIM_BDTR_DTG_Pos)             ///< Bit 3
#define TIM_BDTR_DTG_4                  (0x10U << TIM_BDTR_DTG_Pos)             ///< Bit 4
#define TIM_BDTR_DTG_5                  (0x20U << TIM_BDTR_DTG_Pos)             ///< Bit 5
#define TIM_BDTR_DTG_6                  (0x40U << TIM_BDTR_DTG_Pos)             ///< Bit 6
#define TIM_BDTR_DTG_7                  (0x80U << TIM_BDTR_DTG_Pos)             ///< Bit 7
#define TIM_BDTR_LOCK_Pos               (8)
#define TIM_BDTR_LOCK                   (0x03U << TIM_BDTR_LOCK_Pos)            ///< LOCK[1:0] bits (Lock Configuration)
#define TIM_BDTR_LOCK_OFF               (0x00U << TIM_BDTR_LOCK_Pos)            ///< Lock Off
#define TIM_BDTR_LOCK_1                 (0x01U << TIM_BDTR_LOCK_Pos)            ///< Lock Level 1
#define TIM_BDTR_LOCK_2                 (0x02U << TIM_BDTR_LOCK_Pos)            ///< Lock Level 2
#define TIM_BDTR_LOCK_3                 (0x03U << TIM_BDTR_LOCK_Pos)            ///< Lock Level 3
#define TIM_BDTR_OSSI_Pos               (10)
#define TIM_BDTR_OSSI                   (0x01U << TIM_BDTR_OSSI_Pos)            ///< Off-State Selection for Idle mode
#define TIM_BDTR_OSSR_Pos               (11)
#define TIM_BDTR_OSSR                   (0x01U << TIM_BDTR_OSSR_Pos)            ///< Off-State Selection for Run mode
#define TIM_BDTR_BKE_Pos                (12)
#define TIM_BDTR_BKE                    (0x01U << TIM_BDTR_BKE_Pos)             ///< Break enable
#define TIM_BDTR_BKP_Pos                (13)
#define TIM_BDTR_BKP                    (0x01U << TIM_BDTR_BKP_Pos)             ///< Break Polarity
#define TIM_BDTR_AOE_Pos                (14)
#define TIM_BDTR_AOE                    (0x01U << TIM_BDTR_AOE_Pos)             ///< Automatic Output enable
#define TIM_BDTR_MOE_Pos                (15)
#define TIM_BDTR_MOE                    (0x01U << TIM_BDTR_MOE_Pos)             ///< Main Output enable

#if defined(__MM3O1) || defined(__MM0P1) || defined(__MM0Q1)
    #define TIM_BDTR_DOE_Pos            (16)
    #define TIM_BDTR_DOE                (0x01U << TIM_BDTR_DOE_Pos)             ///< Direct Output enable
#endif

////////////////////////////////////////////////////////////////////////////////
/// @brief TIM_DCR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define TIM_DCR_DBA_Pos                 (0)
#define TIM_DCR_DBA                     (0x1FU << TIM_DCR_DBA_Pos)              ///< DBA[4:0] bits (DMA Base Address)
#define TIM_DCR_DBA_0                   (0x01U << TIM_DCR_DBA_Pos)              ///< Bit 0
#define TIM_DCR_DBA_1                   (0x02U << TIM_DCR_DBA_Pos)              ///< Bit 1
#define TIM_DCR_DBA_2                   (0x04U << TIM_DCR_DBA_Pos)              ///< Bit 2
#define TIM_DCR_DBA_3                   (0x08U << TIM_DCR_DBA_Pos)              ///< Bit 3
#define TIM_DCR_DBA_4                   (0x10U << TIM_DCR_DBA_Pos)              ///< Bit 4
#define TIM_DCR_DBL_Pos                 (8)
#define TIM_DCR_DBL                     (0x1FU << TIM_DCR_DBL_Pos)              ///< DBL[4:0] bits (DMA Burst Length)
#define TIM_DCR_DBL_0                   (0x01U << TIM_DCR_DBL_Pos)              ///< Bit 0
#define TIM_DCR_DBL_1                   (0x02U << TIM_DCR_DBL_Pos)              ///< Bit 1
#define TIM_DCR_DBL_2                   (0x04U << TIM_DCR_DBL_Pos)              ///< Bit 2
#define TIM_DCR_DBL_3                   (0x08U << TIM_DCR_DBL_Pos)              ///< Bit 3
#define TIM_DCR_DBL_4                   (0x10U << TIM_DCR_DBL_Pos)              ///< Bit 4

////////////////////////////////////////////////////////////////////////////////
/// @brief TIM_DMAR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define TIM_DMAR_DMAB                   (0xFFFFU)                               ///< DMA register for burst accesses

////////////////////////////////////////////////////////////////////////////////
/// @brief TIM_CCMR3 Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#if defined(__MM0P1) || defined(__MM0Q1)
    #define TIM_CCMR3_OC5FE_Pos         (2)
    #define TIM_CCMR3_OC5FE             (0x01U << TIM_CCMR3_OC5FE_Pos)          ///< Output Compare 5 Fast enable
    #define TIM_CCMR3_OC5PE_Pos         (3)
    #define TIM_CCMR3_OC5PE             (0x01U << TIM_CCMR3_OC5PE_Pos)          ///< Output Compare 5 Preload enable
    #define TIM_CCMR3_OC5M_Pos          (4)
    #define TIM_CCMR3_OC5M              (0x07U << TIM_CCMR3_OC5M_Pos)           ///< OC5M[2:0] bits (Output Compare 5 Mode)
    #define TIM_CCMR3_OC5CE_Pos         (7)
    #define TIM_CCMR3_OC5CE             (0x01U << TIM_CCMR3_OC5CE_Pos)          ///< Output Compare 5 Clear Enable

////////////////////////////////////////////////////////////////////////////////
/// @brief TIM_CCR5 Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
    #define TIM_CCR5_CCR5               (0xFFFF)                                ///< Capture/Compare 5 Value
#endif

////////////////////////////////////////////////////////////////////////////////
/// @brief UART_TDR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define UART_TDR_TXREG_Pos              (0)
#define UART_TDR_TXREG                  (0xFFU << UART_TDR_TXREG_Pos)           ///< Transmit data register

////////////////////////////////////////////////////////////////////////////////
/// @brief UART_RDR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define UART_RDR_RXREG_Pos              (0)
#define UART_RDR_RXREG                  (0xFFU << UART_RDR_RXREG_Pos)           ///< Receive data register

////////////////////////////////////////////////////////////////////////////////
/// @brief UART_CSR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define UART_CSR_TXC_Pos                (0)
#define UART_CSR_TXC                    (0x01U << UART_CSR_TXC_Pos)             ///< Transmit complete flag bit
#define UART_CSR_RXAVL_Pos              (1)
#define UART_CSR_RXAVL                  (0x01U << UART_CSR_RXAVL_Pos)           ///< Receive valid data flag bit
#define UART_CSR_TXFULL_Pos             (2)
#define UART_CSR_TXFULL                 (0x01U << UART_CSR_TXFULL_Pos)          ///< Transmit buffer full flag bit
#define UART_CSR_TXBUF_EMPTY_Pos        (3)
#define UART_CSR_TXBUF_EMPTY            (0x01U << UART_CSR_TXBUF_EMPTY_Pos)     ///< Transmit buffer empty flag bit

////////////////////////////////////////////////////////////////////////////////
/// @brief UART_ISR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define UART_ISR_TX_INTF_Pos            (0)
#define UART_ISR_TX_INTF                (0x01U << UART_ISR_TX_INTF_Pos)         ///< Transmit buffer empty interrupt flag bit
#define UART_ISR_RX_INTF_Pos            (1)
#define UART_ISR_RX_INTF                (0x01U << UART_ISR_RX_INTF_Pos)         ///< Receive valid data interrupt flag bit

