mm32/MM32_FDS/library/startup/inc/_mm32.h
#if defined(__MM0P1) || defined(__MM0Q1)
    #define UART_ISR_TXC_INTF_Pos       (2)
    #define UART_ISR_TXC_INTF           (0x01U << UART_ISR_TXC_INTF_Pos)        ///< Transmit complete interrupt flag bit
#endif

#define UART_ISR_RXOERR_INTF_Pos        (3)
#define UART_ISR_RXOERR_INTF            (0x01U << UART_ISR_RXOERR_INTF_Pos)     ///< Receive overflow error interrupt flag bit
#define UART_ISR_RXPERR_INTF_Pos        (4)
#define UART_ISR_RXPERR_INTF            (0x01U << UART_ISR_RXPERR_INTF_Pos)     ///< Parity error interrupt flag bit

#if defined(__MM3N1) || defined(__MM0N1)
#define UART_ISR_RXFERR_INTF_Pos        (5)
#define UART_ISR_RXFERR_INTF            (0x01U << UART_ISR_RXFERR_INTF_Pos)     ///< Frame error interrupt flag bit
#endif

#if defined(__MM0P1) || defined(__MM0Q1)
#endif

#define UART_ISR_RXBRK_INTF_Pos         (6)
#define UART_ISR_RXBRK_INTF             (0x01U << UART_ISR_RXBRK_INTF_Pos)      ///< Receive frame break interrupt flag bit

#if defined(__MM0P1) || defined(__MM0Q1)
    #define UART_ISR_TXBRK_INTF_Pos     (7)
    #define UART_ISR_TXBRK_INTF         (0x01U << UART_ISR_TXBRK_INTF_Pos)      ///< Transmit Break Frame Interrupt Flag Bit
    #define UART_ISR_RXB8_INTF_Pos      (8)
    #define UART_ISR_RXB8_INTF          (0x01U << UART_ISR_RXB8_INTF_Pos)       ///< Receive Bit 8 Interrupt Flag Bit
#endif

////////////////////////////////////////////////////////////////////////////////
/// @brief UART_IER Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define UART_IER_TXIEN_Pos              (0)
#define UART_IER_TXIEN                  (0x01U << UART_IER_TXIEN_Pos)           ///< Transmit buffer empty interrupt enable bit
#define UART_IER_RXIEN_Pos              (1)
#define UART_IER_RXIEN                  (0x01U << UART_IER_RXIEN_Pos)           ///< Receive buffer interrupt enable bit

#if defined(__MM0P1) || defined(__MM0Q1)
    #define UART_IER_TXCIEN_Pos         (2)
    #define UART_IER_TXCIEN             (0x01U << UART_IER_TXCIEN_Pos)          ///< Transmit complete interrupt enable bit
#endif

#define UART_IER_RXOERREN_Pos           (3)
#define UART_IER_RXOERREN               (0x01U << UART_IER_RXOERREN_Pos)        ///< Receive overflow error interrupt enable bit
#define UART_IER_RXPERREN_Pos           (4)
#define UART_IER_RXPERREN               (0x01U << UART_IER_RXPERREN_Pos)        ///< Parity error interrupt enable bit

#if defined(__MM3N1) || defined(__MM0N1)
#define UART_IER_RXFERREN_Pos           (5)
#define UART_IER_RXFERREN               (0x01U << UART_IER_RXFERREN_Pos)        ///< Frame error interrupt enable bit
#endif

#if defined(__MM0P1) || defined(__MM0Q1)
#endif

#define UART_IER_RXBRKEN_Pos            (6)
#define UART_IER_RXBRKEN                (0x01U << UART_IER_RXBRKEN_Pos)         ///< Receive frame break interrupt enable bit

#if defined(__MM0P1) || defined(__MM0Q1)
    #define UART_IER_TXBRKIEN_Pos       (7)
    #define UART_IER_TXBRKIEN           (0x01U << UART_IER_TXBRKIEN_Pos)        ///< Transmit Break Frame Interrupt Enable Bit
    #define UART_IER_RXB8IEN_Pos        (8)
    #define UART_IER_RXB8IEN            (0x01U << UART_IER_RXB8IEN_Pos)         ///< Receive Bit 8 Interrupt Enable Bit
#endif

////////////////////////////////////////////////////////////////////////////////
/// @brief UART_ICR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////

#define UART_ICR_TXICLR_Pos             (0)
#define UART_ICR_TXICLR                 (0x01U << UART_ICR_TXICLR_Pos)          ///< Transmit buffer empty interrupt clear bit
#define UART_ICR_RXICLR_Pos             (1)
#define UART_ICR_RXICLR                 (0x01U << UART_ICR_RXICLR_Pos)          ///< Receive interrupt clear bit

#if defined(__MM0P1) || defined(__MM0Q1)
    #define UART_ICR_TXCCLR_Pos         (2)
    #define UART_ICR_TXCCLR             (0x01U << UART_ICR_TXCCLR_Pos)          ///< Transmit complete interrupt clear bit
#endif

#define UART_ICR_RXOERRCLR_Pos          (3)
#define UART_ICR_RXOERRCLR              (0x01U << UART_ICR_RXOERRCLR_Pos)       ///< Receive overflow error interrupt clear bit
#define UART_ICR_RXPERRCLR_Pos          (4)
#define UART_ICR_RXPERRCLR              (0x01U << UART_ICR_RXPERRCLR_Pos)       ///< Parity error interrupt clear bit

#if defined(__MM3N1) || defined(__MM0N1)
#define UART_ICR_RXFERRCLR_Pos          (5)
#define UART_ICR_RXFERRCLR              (0x01U << UART_ICR_RXFERRCLR_Pos)       ///< Frame error interrupt clear bit
#endif

#if defined(__MM0P1) || defined(__MM0Q1)
#endif

#define UART_ICR_RXBRKCLR_Pos           (6)
#define UART_ICR_RXBRKCLR               (0x01U << UART_ICR_RXBRKCLR_Pos)        ///< Receive frame break interrupt clear bit

#if defined(__MM0P1) || defined(__MM0Q1)
    #define UART_ICR_TXBRKCLR_Pos       (7)
    #define UART_ICR_TXBRKCLR           (0x01U << UART_ICR_TXBRKCLR_Pos)        ///< Transmit Break Frame Interrupt clear Bit
    #define UART_ICR_RXB8CLR_Pos        (8)
    #define UART_ICR_RXB8CLR            (0x01U << UART_ICR_RXB8CLR_Pos)         ///< Receive Bit 8 Interrupt clear Bit
#endif

////////////////////////////////////////////////////////////////////////////////
/// @brief UART_GCR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define UART_GCR_UARTEN_Pos             (0)
#define UART_GCR_UARTEN                 (0x01U << UART_GCR_UARTEN_Pos)          ///< UART mode selection bit
#define UART_GCR_DMAMODE_Pos            (1)
#define UART_GCR_DMAMODE                (0x01U << UART_GCR_DMAMODE_Pos)         ///< DMA mode selection bit
#define UART_GCR_AUTOFLOWEN_Pos         (2)
#define UART_GCR_AUTOFLOWEN             (0x01U << UART_GCR_AUTOFLOWEN_Pos)      ///< Automatic flow control enable bit
#define UART_GCR_RXEN_Pos               (3)
#define UART_GCR_RXEN                   (0x01U << UART_GCR_RXEN_Pos)            ///< Enable receive
#define UART_GCR_TXEN_Pos               (4)
#define UART_GCR_TXEN                   (0x01U << UART_GCR_TXEN_Pos)            ///< Enable transmit

////////////////////////////////////////////////////////////////////////////////
/// @brief UART_CCR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define UART_CCR_PEN_Pos                (0)
#define UART_CCR_PEN                    (0x01U << UART_CCR_PEN_Pos)             ///< Parity enable bit
#define UART_CCR_PSEL_Pos               (1)
#define UART_CCR_PSEL                   (0x01U << UART_CCR_PSEL_Pos)            ///< Parity selection bit

#define UART_CCR_SPB_Pos                (2)
#define UART_CCR_SPB                    (0x01U << UART_CCR_SPB_Pos)             ///< Stop bit selection

